info/tutorial.org
#+TITLE:  A Simple Introduction to Emacspeak
#+AUTHOR: Alex Midence
#+EMAIL: Ho-Lamat@users.sourceforge.net
#+DESCRIPTION:  A non-technical introduction to Emacspeak.
#+KEYWORDS:  Emacspeak audio desktop accessible linux editor authoring programming 
#+TEXT:  This document is part of the Vinux Documentation Project.  For more information about Vinux, please visit the [[http://www.vinux-project.org][Vinux Homepage]] by following this link.  The speech synthesizer used in Vinux installations of Emacspeak is Espeak.  Adjust any references to Words per minute, pitch and so forth to the speech synthesizer of your choice.  Also, while Vinux is the distribution whose users are targeted in this tutorial, some pains were taken to make instructions as distro-independent as possible.  Exceptions to this include but are not limited to using synaptic package manager to install packages and instructions to type "sudo" in the command line for things requiring root permissions as this is how such things are done in Ubuntu which is what Vinux is based upon as of this writing.

* Introduction
In past years, there have been quite a few excellent reference
materials written on Emacspeak by its author, Dr. T. V. Raman, and by
other members of its user community.  Because of this, I will tell you
right now that I won't try to reproduce their work since for one
thing, I can't hope to equal the job they did much less top it, and
for another, I find writing reference materials to be a rather boring
and tedious business best left to the pros.  No, dear reader, this is
something far simpler and far more digestible.  What we have here is a
no frills Emacspeak how-to or tutorial if you will permit such a term
whose main purpose is to tell you what you need to know and do to
accomplish something productive within 5 minutes of launching it.  So,
it's going to be very non-technical and very superficial.  Because of
this, there will be many places where you are encouraged to refer to
the Info Pages or to another on line resource that does provide that
technical information so you can consult it and really start learning
this amazing application.  It is my conviction that you will be quite
unable to truly realize your productive potential until you have
tinkered with it a bit and learned a thing or two about how it works
under the hood.  This is Linux, after all where a look under the hood
of any application is a must from time to time.  I hope you find this
tutorial useful and that it helps you get past the usual hurdles
newcomers to Emacspeak face.  If there is anything you would like
included in future versions, e-mail me directly or send an e-mail to
the vinux support group at [[mailto:vinux-support@googlegroups.com][vinux-support@googlegroups.com]].


