info/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-28 Sun 07:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Simple Introduction to Emacspeak</title>
<meta name="author" content="Alex Midence" />
<meta name="description" content="A non-technical introduction to Emacspeak." />
<meta name="keywords" content="Emacspeak audio desktop accessible linux editor authoring programming" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A Simple Introduction to Emacspeak</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9a6455c">1. Introduction</a>
<ul>
<li><a href="#orgc797f7a">1.1. Who is this for?</a></li>
<li><a href="#orgee4bdf6">1.2. How best to use this Tutorial</a></li>
<li><a href="#org077cfd0">1.3. What is Emacs and obtaining information on it through Info.</a>
<ul>
<li><a href="#org51bd119">1.3.1. The Emacs Help system</a></li>
<li><a href="#org3312d1a">1.3.2. Using the menu bar to access help</a></li>
<li><a href="#orgf948761">1.3.3. Hotkeys for getting help.</a></li>
</ul>
</li>
<li><a href="#orgb08b717">1.4. What is Emacspeak and where to find the user's manual.</a>
<ul>
<li><a href="#orgec255e7">1.4.1. Emacspeak and getting help</a></li>
</ul>
</li>
<li><a href="#orged83ce0">1.5. Navigation</a>
<ul>
<li><a href="#org510c8f0">1.5.1. Movement commands.</a></li>
<li><a href="#org8086c6b">1.5.2. Reading Commands</a></li>
<li><a href="#org072a17f">1.5.3. Other commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0714b72">2. Configuration</a>
<ul>
<li><a href="#orgb7e47f2">2.1. Setting up your environment</a>
<ul>
<li><a href="#org144c811">2.1.1. Voice rate, punctuation level and key echo</a></li>
</ul>
</li>
<li><a href="#org30e6377">2.2. Customizing Emacs using Easy Customizations</a></li>
<li><a href="#org608618b">2.3. Configuring Emacspeak on the fly</a>
<ul>
<li><a href="#org027c31f">2.3.1. Audible Icons</a></li>
<li><a href="#org27c683c">2.3.2. A sample of a .emacs file's contents</a></li>
</ul>
</li>
<li><a href="#orgeb749d5">2.4. Adding pluggins or extensions</a>
<ul>
<li><a href="#org3bbbac1">2.4.1. Adding packages through Synaptic</a></li>
</ul>
</li>
<li><a href="#orgd9d5e30">2.5. Using Elpa  to extend your Emacs</a></li>
</ul>
</li>
<li><a href="#orgcb7958d">3. Putting it to use.</a>
<ul>
<li><a href="#org6ca7ea3">3.1. First Launch of Emacspeak</a></li>
<li><a href="#org4482072">3.2. Additional notes</a></li>
</ul>
</li>
<li><a href="#org2e62318">4. Manipulating  text</a>
<ul>
<li><a href="#org2aab56b">4.1. Your first text file</a>
<ul>
<li><a href="#org1088c2f">4.1.1. But wait!  What about spell checking?</a></li>
<li><a href="#orgb2f261f">4.1.2. Visiting files</a></li>
</ul>
</li>
<li><a href="#org3e7cac9">4.2. Let's make a webpage!</a>
<ul>
<li><a href="#org2a6da47">4.2.1. Fil in the Sections</a></li>
<li><a href="#orgeb278e5">4.2.2. Creating Links</a></li>
<li><a href="#org1d6f9fe">4.2.3. Exercise:</a></li>
<li><a href="#org10a9d53">4.2.4. Exporting to html</a></li>
</ul>
</li>
<li><a href="#org7f74080">4.3. Let's write some code!</a>
<ul>
<li><a href="#orgceb5401">4.3.1. Exercise:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org987bf3e">5. Onto the wide wide world:</a>
<ul>
<li><a href="#org6fc259e">5.1. How about a chat?</a>
<ul>
<li><a href="#org64f930a">5.1.1. Actual chatting tips</a></li>
</ul>
</li>
<li><a href="#org39e0711">5.2. Let's browse the web.</a>
<ul>
<li><a href="#org4b148fd">5.2.1. Url Templates</a></li>
<li><a href="#orgfe8f7f9">5.2.2. Exercise.</a></li>
</ul>
</li>
<li><a href="#orgd86ba6f">5.3. Sending e-mail</a></li>
</ul>
</li>
<li><a href="#org2f43f3e">6. Retreat into your shell, why don't you?</a></li>
<li><a href="#org21cee48">7. File Management</a></li>
<li><a href="#org4d49a54">8. Playing media files in Emacspeak</a></li>
<li><a href="#orga37a243">9. Wrapping it up</a></li>
<li><a href="#org1cd7808">10. Acknowledgements</a></li>
<li><a href="#org1633df5">11. Appendices</a>
<ul>
<li><a href="#org0c0784f">11.1. Installing Emacspeak</a>
<ul>
<li><a href="#org0710214">11.1.1. Using Synaptic</a></li>
<li><a href="#orge13a8b7">11.1.2. Using the command line</a></li>
</ul>
</li>
<li><a href="#org9c7dd64">11.2. Emacs and Emacspeak links:  For when you want to go fishing</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9a6455c" class="outline-2">
<h2 id="org9a6455c"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In past years, there have been quite a few excellent reference
materials written on Emacspeak by its author, Dr. T. V. Raman, and by
other members of its user community.  Because of this, I will tell you
right now that I won't try to reproduce their work since for one
thing, I can't hope to equal the job they did much less top it, and
for another, I find writing reference materials to be a rather boring
and tedious business best left to the pros.  No, dear reader, this is
something far simpler and far more digestible.  What we have here is a
no frills Emacspeak how-to or tutorial if you will permit such a term
whose main purpose is to tell you what you need to know and do to
accomplish something productive within 5 minutes of launching it.  So,
it's going to be very non-technical and very superficial.  Because of
this, there will be many places where you are encouraged to refer to
the Info Pages or to another on line resource that does provide that
technical information so you can consult it and really start learning
this amazing application.  It is my conviction that you will be quite
unable to truly realize your productive potential until you have
tinkered with it a bit and learned a thing or two about how it works
under the hood.  This is Linux, after all where a look under the hood
of any application is a must from time to time.  I hope you find this
tutorial useful and that it helps you get past the usual hurdles
newcomers to Emacspeak face.  If there is anything you would like
included in future versions, e-mail me directly or send an e-mail to
the vinux support group at <a href="mailto:vinux-support@googlegroups.com">vinux-support@googlegroups.com</a>.
</p>
</div>
