info/tutorial.org
**  Who is this for?

This tutorial is for anyone who is interested in adding another
accessibility tool to their assistive tool chest whether they come
from Windows, Mac or Linux.  A lot of thought has gone into how to
introduce this tool to people who are coming from GUI environments.
Because of this, it will deviate from the usual path and ease you into
hotkeys by first showing you the menu system of Emacs.  We will also
talk about movement and navigation using more common naming
conventions such as the ones you would find in Gnome, Windows or Mac.
This is because these days, the overwhelming majority of blind people
use Windows and the screen readers that make it accessible.  Gone are
the days when most of us were command line users though, we have not
entirely lost our love for the mighty hotkey.  So, don't think the
hotkeys will be ignored.  Far from it since the menus in Emacs are its
training wheels and you can't really start doing things quickly until
you have learned at least the basic hotkeys.  Learning hotkeys takes
time though and, meanwhile, you actually want to DO something as in
right now without having to feel like a schoolboy or girl memorizing
lines for some poem or play or something like that.  This is why menus
will be talked about a lot.

What this tutorial will not teach you is how to use Linux in general.
That topic is huge and far too encompassing to cover here.  If you
come across terms you don't understand or have never heard before, I
want you to make extensive use of Google, info, and the man pages.  If
there is one lesson which is Linux-wide which I will teach you, it is
this:

Linux does not hand everything to you on a silver platter ready for
you to just pick up a fork and dig in.  This is especially true of
information.  It assumes you are smart enough to learn through
research and that you are capable of thinking for yourself.  This is
pretty much the modus operandi across all flavors of it and in much of
the software that runs on it.  Inevitably, it will manifest itself in
the people who use it as well.  In more extreme cases, some Linux
users can come across as testy and unhelpful geeks from a newbie's
perspective when they are asked what they feel are simple questions
whose answers aren't hard to find with a little effort on the part of
the inquirer.  It is because they assume that you are smart enough to
use a search engine, browse forums, read help files and tinker a bit
to solve your problem.  It is what they did, after all, and they
figure you can do the same.  They can usually tell when you haven't
based on your questions so, research before you ask or be frank in
admitting that you haven't and why because this is expected of you in
this environment much more so than in Windows or Mac where you paid
money therefore you have some rights when it comes to support.  Many
are particularly touchy about whether or not people read help files or
manuals since they might have put time and effort into writing that
stuff and don't feel like repeating themselves when they've made their
help available to you in this form.  Writing this stuff isn't easy and
the overwhelming majority of those of us who write tutorials, man
pages, help files and documentation don't get paid a single solitary
cent for our efforts.  The best pay in the world someone who puts
their time and mental resources into writing an informational resource
for no monetary compensation can get is for someone to use that
resource thereby making their time and efforts worthwhile.  "Hint hint
... nudge, nudge, know what I mean?"  Please tell me you know Monty
Python!  Ok, enough rabbit trails.

So, while this document will hold your hand in parts to some extent in
order to minimize some of the infamous Emacs/Emacspeak learning curve,
I will not insult your intelligence by over explaining when I know
perfectly well that you are capable enough to read and research other
sources on your own nor will I seek to duplicate the work done by
others when there are lots of perfectly serviceable sources of
information on just about any and all topics I covered here.  In spite
of this, you may decide that there is something missing or something
can be made better and you are the one who can make that happen
whereupon, you roll up your sleeves, stock up on caffeine and turn
your back on Morpheus' restful embrace for a night or two while you
make your contribution.  If you do, then, be welcome among us for you
are become one of us in truth.  Free and open source software is about
everyone working together towards making things better for the good of
all.  It is the price we gladly pay for free software.


** How best to use this Tutorial

The best way to use this tutorial is to read it using an application
and in an environment you already know well such as note pad or,
Internet Explorer in Windows with your favorite screen reader or a
text editor like Gedit or the Firefox browser in Gnome with Orca as
the screen reader or, maybe Nano or Vim in the Linux Console with
Speakup.  Mac users, I am sorry, I don't know Mac at all so I am
afraid it'll be up to you to decide which editor works best for you on
your end.  If you are using a browser with a screen reader to access
this in its html form, you can navigate quickly through major chapters
by using whatever key your screen reader designates for level 2
headings.  I do not recommend you try reading this tutorial in
Emacspeak if you don't know anything about it since you'll spend most
of your time trying to move around in it and won't be able to focus on
the content as easily.  This might cause you some frustration and the
whole point of this is to make things easier on you so you don't give
up when you first make contact with Emacspeak.  It's got a very unique
way of doing things and, it can take some getting used to at first.

Another thing to note is that this document is not a replacement for
reading the Emacspeak user's manual and the Emacs User's manual and
certainly not for going through the Emacs Tutorial.  These are all
very valuable resources and you would be very well-advised to put them
to use.  In fact, if you are already running Linux, you can take a
gander at the Emacs user's manual by typing info Emacs at the command
line and browsing through it there.  It'll make you want to try stuff
and this is a good thing.


