info/tutorial.html


<div id="outline-container-org077cfd0" class="outline-3">
<h3 id="org077cfd0"><span class="section-number-3">1.3.</span> What is Emacs and obtaining information on it through Info.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
So, what is Emacs?  I thought we were learning about Emacspeak here.
Well, Emacs is the application which Emacspeak causes to talk and
react in a way that is more productive and efficient for someone using
speech to interact with their computer.  Ok, so what is Emacs then?
You will find lots and lots of definitions and descriptions of it on
line claiming all sorts of things about it from calling it a superb
editor, or a desktop to calling it a bloated piece of software that
doesn't compare to whatever else that person thinks is awesome and
cool.  Honestly, though, Emacs is a text editor that got extended and
enhanced to such an extent that it will now do just about anything you
want to do on a machine.  It will let you edit since it's never
stopped being a superb text editor.  It will play music for you, brows
the web, send e-mail, organize your life for you, run a shell for you,
help you write programs and webpages and on, and on, and on.  It's
because it can do all this stuff that people refer to Emacs as a
desktop even though it is still at its heart an editor.  That's Editor
with a capital E, mind.  It is probably the single most powerful
editor you will ever use.  If you want to take a moment to read about
the many uses to which you can put Emacs, you could hop online and
read the
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">web
version of the Emacs manual</a> by following the link I just gave you.
</p>

<p>
Emacs, believe it or not, is pretty easy to learn.  It has a
reputation for being newbie friendly.  There are tons of resources
inside of it and out on the web for learning how to use it and become
productive quickly.  For instance,
<a href="http://www.emacswiki.org/emacs/EmacsNewbie">here is a nice page</a>
dedicated specifically to newbies learning their way around Emacs.
When you first bring it up and, for that matter, from anywhere within
it, you always have the option of typing control h t and bringing up
the Emacs Tutorial.  Anyone who wants to learn to use Emacs should
take this tutorial at first opportunity.  I cannot recommend it
strongly enough.  This will show you how to move around in Emacs and
walk you through a few basic editing commands.  Even more help can be
found inside the Info Pages.  Info is the system Emacs uses to store
its help files.  They are browsable much like webpages are with
hyperlinks and the like.  In fact, before we go any further, let's
talk about the help system a bit.
</p>
</div>
