info/tutorial.org
***  The Emacs Help system
Emacs has been around a long time.  Because of this, and thanks to the
efforts of the man who wrote it, Mr. Richard M. Stallman of Gnu fame,
and all the others who contributed, the help files are very extensive,
very well-written and a valuable tool for anyone learning Emacs.  To
be honest, it is quite possibly one of the best documented pieces of
software I have ever seen period.  If you want to have a look at
things before you bring up Emacs, you can type info emacs at the
command line prompt and browse the help pages from there or, of
course, you can browse them from within Emacs itself.  To access the
help system, you either select it using the menu bar, use a c-h
combination, or by pressing m-x (meta x) and typing info.  More on m-x
later.  Shortly, we will discuss getting help from the menu bar.
Then, we'll have a look at some hotkey shortcuts to this information.
First though, some naming conventions which will make your life
easier:

+  Control key combinations:  Anything requiring you to hold down the control key and press another key will be abbreviated as follows:  c-h for control h, c-f for control f and so forth.
+  Meta key combinations:  Meta is a key assigned to the alt key in most keyboards.  It is abbreviated the same way the control key is so, m-f and m-b are meta f and meta b.  They are performed by holding down the alt key (meta) and pressing the other key indicated.  M-f is alt+f in Windows-type lingo.
+  Shift key combinations:  You probably guessed this one.  s followed by a dash is short for holding down shift and hitting something else.  Most of the time, shift is held down in conjunction with something else.  For instance, m-s-, is alt+shift+comma.  These combinations are actually pretty rarely displayed as m-s-something.  Usually, they tell you to hit m-something where that something can only be gotten to by hitting shift.  For example, m-< for top of buffer and m-> for bottom of buffer. You can usually only get to the < and > signs by holding shift and hitting the comma and period respectively.  So, m-s-, and m-s-.  That takes forever to write hence the shortened form I told you about.
+ Prefixes:  To get around the problem of running out of hotkeys, Emacs has prefixes.  Prefixes are hotkey combinations that make Emacs wait for a second or third key to execute something.  For instance, c-e c-a.  c-e is the Emacspeak prefix.  c-a turns on auditory icons when preceded by this prefix.  Another example is c-e d 5.  c-e is the emacspeak prefix, d is the dtk speech sub prefix and the 5 is the present speech rate level 5.  That one has 3 key combinations.  This way, you can always have hotkeys for stuff without fear of your keyboard running out of keys to combine.  Clever, huh?  Here are three very common prefixes for you:
  -  c-e:  This is the Emacspeak prefix.  Anything you want to run that has been put there as an emacspeak-specific feature, you will access with the c-e prefix and then the combination in question.  For instance, c-e c-a turns on your auditory icons.  Try it out, auditory icons are like what Jaws users might call sound schemes.  Use them a bit and they become self-explanatory.
  -  c-u:  Argument prefix.  This one is way cool.  It lets you put in a numerical argument that causes whatever you type next to repeat by how many times the number you put in would require.  For instance, c-u 4 c-n makes you move down 4 lines.  Emacspeak uses the argument prefix to make changes global instead of local.  For instance, the c-e c-a combination we used earlier only makes auditory icons turn on locally.  To turn them on globally, type c-u c-e c-a and you have them on everywhere in Emacspeak.
  -  c-c:  This prefix is a generic prefix which many other extensions of Emacs use for functions specific to their particular modes.  
+  Modes:  Emacs has major and minor modes.  No, music lovers, this has nothing to do with Ionian and mixolidian.  Modes are, for lack of a better word, behavior parameters.  Each time you change mode, you make Emacs behave differently.  The hotkey combinations change their function in subtle ways that are in the context of whatever mode you switched to.  Each extension of Emacs often has one or more major and several minor modes that alter its behavior according to what that extension helps you accomplish.
+  Buffers:  Buffers are regions Emacs uses to separate information.
  They are not physical and should not be confused with windows though
  they do many of the same things you are used to thinking of when you
  think about what a window does.  The Emacs user's manual has
  [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Buffers.html][a
  very good explanation]] of what they are and I suggest you explore
  them both in this link and using the emacs tutorial so as to
  familiarize yourself with the concept.  To get a list of buffers
  similar to a "Window list" or "applications list" which is what you
  may be used to in Windows land, type c-x c-b.  Just arrow up and
  down and press enter on the one you want to switch to.
+  Windows:  These are physical regions of the screen used to display
  information.  For instance, you can have the buffer containing the
  document you are editing split into two windows with one showing
  where you are typing and the other one showing another part of the
  same document.  The Emacs Manual has
  [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Screen.html#Screen][an
  excellent section]] on how the screen is divided in Emacs.  It goes
  into more detail and also explains what frames and rectangles are in
  the Emacs context.

Now that these are out of the way, Let's go back to talking about help
and reading it.


