info/tutorial.org
***  Using the menu bar to access help
This is as good a time as any to formally introduce the menu bar.
Emacs has one that will be easy for Gnome, Windows or Mac users to
navigate without any problem.  Hold down the alt or meta key as Emacs
calls it and press your grave button which on the U.S. keyboard, is
located to the left of the number 1.  Some folks call it the back
tick.  If this doesn't work with your particular keyboard, try hitting
f10.  The menus are file, edit, options, buffers, tools and help.  To
go from one to the other, use your up and down arrows.  To select one,
press enter and arrow up and down through its options.  When you find
the one you want, press enter.  If you make a mistake and want to
start over, press c-g or control g which is the Emacs quit command.
It is very similar to what you are used to but with a slight variation
in the actual menus themselves since you don't use right and left
arrow.  Sometimes there are more menu items than this when you are in
certain pluggins or modes, as they are called but these which I listed
here are always present.  You will see this for yourself when we
explore some of the modes we'll be covering in this tutorial.  The
help menu is the one you want for this section so press enter on it
when you hear it.

The items in the help menu are as follows:
+  Emacs tutorial
+  Emacs tutorial change language
+  Emacs FAQ
+  Emacs news
+  Emacs known problems
+  Submit Bug Report
+  Emacs psychotherapist 
+  Search the help files
+  Key Describe
+  Read the manual
+  Find Emacs Packages
+  External packages
+  Getting new versions
+  Textual links about copying, redistributing and such.  

The ones to look at first are the "Emacs tutorial", "read the manual"
and "key describer".  Each of these has a hotkey bound to it.  I
suggest you learn these as you will probably be using the help system
a lot at first.  In truth, you will never stop using the help system
since Emacs has so many features and so much functionality that you
will discover new stuff all the time for which you'll need to read the
help files.  To get back to your work, just open up the buffer list
with c-x c-b and arrow up and down till you get to the buffer
containing what you were doing and press enter.  If you want to get
rid of the help buffer you were reading, kill it by typing c-x k and
pressing enter.

***  Hotkeys for getting help.

If you find the menu bar cumbersome, and, believe me you will
eventually, here are the hotkeys for accessing help from Emacs.  Note
that they all have the c-h prefix:

-  c-h i:  Read the Emacs manual using info.  Info is the system Emacs
  uses for its documentation.  It resembles webpages complete with
  nodes and hyperlinks.  You type enter on a link to follow it, n for
  next node (chapter), p for the previous one, and space bar to move
  forward a page inside the node you are reading.  You can also access
  the info system by pressing m-x and then typing info after which,
  you press return.
-  c-h t:   Emacs Tutorial.   This is a must for anyone learning
  Emacs.  In fact, I'm going to recommend that you follow it at first
  opportunity since it is very well done and will show you how to move
  around in a file.  If you are going to do this, however, skip down
  to the section describing what to expect during your first launch of
  Emacspeak since its unique interface sometimes makes it easy to get
  lost for some people the first time they pull it up.
-  c-h cap M:  This lets you get to a help file that has a list of all the
  hotkeys for a given mode.  Useful for when you get tired of the menu
  bar.  The nice thing about this feature is that each hotkey's
  function is presented as a hyperlink for you to press and read more
  about it if you choose.
-  c-h b:  More or less the same as c-h cap M but much more concise for
  when you just want a quick reference.
-  c-h k:  Key describer.  Just type this hotkey combination and then, at the prompt key in a hotkey you want described and it will tell you all about it.
-  c-h a:  Appropose.  Fancy name for "I want to do x, y and z but I
   have no idea what to push to do it.  Give me a list of possibles."


**  What is Emacspeak and where to find the user's manual. 
Emacspeak is an extension of Emacs written by Dr. T. V. Raman, a blind
computer scientist currently working for Google.  It turns it into a
self-voicing solution that renders it's output in spoken form in a way
that makes it easier for interacting with it without vision.  It added
a lot of commands and changed the behavior of Emacs while doing it so
seamlessly that, you don't realize that you are using emacspeak
features which are not present in an unmodified Emacs.  It is
integrated into Emacs itself to such an extent that people who use it
tend to blur the line between the extension and the application.
While you are learning however, it is important for you to keep the
two apart.  If you learn your way around Emacs you will pick up things
on Emacspeak little by little.  Once you have the basics of Emacs down
and can move around in and edit files, manipulate the contents of a
directory and do a few other things, you can focus completely on
Emacspeak and unlocking its more complex and delightful secrets.  This
learning strategy has worked out rather well for me and it is the path
I suggest for someone who is completely new to Linux and has a strong
background in Windows and the screen reader solutions there.  The
reason for this is that both will require you to learn some new
concepts that are tied to how the application and the extension work
under the hood.  This is very important since customizing often
involves tinkering with some of the stuff under the hood which can be
a bit foreign to the windows user.  The truth is, Windows has spoiled
us by making so much of what goes on under the hood hidden from us and
automated.  A powerful tool like Emacspeak can be a bit daunting at
times for someone used to all the pampering of the Windows environment
where the software developers and distributors take it upon themselves
to think for you and lock you away from the code.  Sometimes, the help
files themselves are a bit hard to follow without first learning this
under-the-hood knowledge so, learning a few things about Emacs will
help you more easily learn how Emacspeak does what it does for you.


