info/tutorial.org
***  Emacspeak and getting help

Emacspeak also has a user's manual which can be accessed using the hot
key combination c-h c-e. Again, that's control h and control e.  I
will gradually stop explaining this as the tutorial progresses so,
make sure you learn what is meant by this naming convention.  The
Emacspeak user's manual contains many useful and practical tips for
getting the most out of it so, make sure you read it.  It is not set
up like the info pages so, this is a great time to really learn how to
move around in a file in Emacspeak.  While browsing this file, you
will notice that some things are spoken in a lower voice.  This is how
Emacspeak tells you that you are on a link.  You can press enter on
any one of these links and get more information on them.  At the end
of each, there is a "back" link which, when you press enter on it,
will take you back to the Emacspeak help page.  There is an online
version of the manual you might enjoy browsing.  Here is its link:

[[http://www.cs.cornell.edu/home/raman/emacspeak/info/emacspeak.html#SEC_Top][Emacspeak
User's Manual]]

Another resource for you is the Emacspeak FAQ.  The FAQ can be found
by typing c-e cap F.  Note that this is a capital f.


**  Navigation

Ok, now that the help system has been introduced, it's time to learn
how to move around a large bunch of text.  This is where we learn some
more hotkeys.  Refer to this section frequently in your adventures
with Emacs since these keys are valid from virtually any environment
in Emacs.  You need to learn these because it is as important to know
them as it was for you to learn all the key combinations Jaws, Window
Eyes, or NVDA and their friends had you learn in windows to move
around.  If you just stick to the arrow keys, (which, of course, you
can), you'll be at it for years and years and wind up giving up.  so,
here we go:

***  Movement commands.  

Where c- stands for control m- stands for meta or alt and s- stands
for shift:

note: If you get stuck and just want out of Emacs altogether, type c-x
and c-c.

| Element | backwards | forwards |
|top/bottom of Entire buffer | m-s-, | m-s-.
| screenfull/page | m-v | c-v |
| line  | c-p | c-n |
|Sentence|m-a|m-e|
|Line Beginning/end|c-a|c-e c-e|
| Word | m-b | m-f |
| Character | c-b | c-f |

Daunting?  Well, at first glance they can be but, here's a mnemonic
device for you:

+  previous, next;  back and forth:  Previous and next line, back and forward word and char.
+  The c-hick is smaller than its m-other:  Meta makes analogous control key combinations do bigger things.  m-f moves forward a word where as little c-f moves forward a character.  Get it?
+  A beginning is usually to the left of the end:  c-a is the beginning of the line and c-e is the end of it.  (Note, Emacspeak uses c-e as a prefix, so you have to hit it twice to make it work right.)

And, c-v and m-v are kind of to be learned on your own.  It's not
because of any special reason other than that I haven't been able to
come up with anything clever by which to remember them.  If you can,
please let us know and we'll stick it in here.  v stands for vertical
is about as far as I've gotten.

***  Reading Commands

Here are some basic reading commands.  Please note that this is not an
exhaustive list.  There are many more.  Use c-h c-e to access the help
file containing them.  These let you read parts of the screen without
moving your cursor:

|element|previous|current|next|
|Buffer| -- | c-e B|-- |
|window|c-e c-p|  |c-e c-n|
|line|c-e up arrow|c-e l|c-e down arrow|
|word|-- |c-e w|-- |
|Char|-- |c-e c| -- |

