info/tutorial.html


<div id="outline-container-orgec255e7" class="outline-4">
<h4 id="orgec255e7"><span class="section-number-4">1.4.1.</span> Emacspeak and getting help</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Emacspeak also has a user's manual which can be accessed using the hot
key combination c-h c-e. Again, that's control h and control e.  I
will gradually stop explaining this as the tutorial progresses so,
make sure you learn what is meant by this naming convention.  The
Emacspeak user's manual contains many useful and practical tips for
getting the most out of it so, make sure you read it.  It is not set
up like the info pages so, this is a great time to really learn how to
move around in a file in Emacspeak.  While browsing this file, you
will notice that some things are spoken in a lower voice.  This is how
Emacspeak tells you that you are on a link.  You can press enter on
any one of these links and get more information on them.  At the end
of each, there is a "back" link which, when you press enter on it,
will take you back to the Emacspeak help page.  There is an online
version of the manual you might enjoy browsing.  Here is its link:
</p>

<p>
<a href="http://www.cs.cornell.edu/home/raman/emacspeak/info/emacspeak.html#SEC_Top">Emacspeak
User's Manual</a>
</p>

<p>
Another resource for you is the Emacspeak FAQ.  The FAQ can be found
by typing c-e cap F.  Note that this is a capital f.
</p>
</div>
</div>
</div>


<div id="outline-container-orged83ce0" class="outline-3">
<h3 id="orged83ce0"><span class="section-number-3">1.5.</span> Navigation</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Ok, now that the help system has been introduced, it's time to learn
how to move around a large bunch of text.  This is where we learn some
more hotkeys.  Refer to this section frequently in your adventures
with Emacs since these keys are valid from virtually any environment
in Emacs.  You need to learn these because it is as important to know
them as it was for you to learn all the key combinations Jaws, Window
Eyes, or NVDA and their friends had you learn in windows to move
around.  If you just stick to the arrow keys, (which, of course, you
can), you'll be at it for years and years and wind up giving up.  so,
here we go:
</p>
</div>

<div id="outline-container-org510c8f0" class="outline-4">
<h4 id="org510c8f0"><span class="section-number-4">1.5.1.</span> Movement commands.</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Where c- stands for control m- stands for meta or alt and s- stands
for shift:
</p>

<p>
note: If you get stuck and just want out of Emacs altogether, type c-x
and c-c.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Element</td>
<td class="org-left">backwards</td>
<td class="org-left">forwards</td>
</tr>

<tr>
<td class="org-left">top/bottom of Entire buffer</td>
<td class="org-left">m-s-,</td>
<td class="org-left">m-s-.</td>
</tr>

<tr>
<td class="org-left">screenfull/page</td>
<td class="org-left">m-v</td>
<td class="org-left">c-v</td>
</tr>

<tr>
<td class="org-left">line</td>
<td class="org-left">c-p</td>
<td class="org-left">c-n</td>
</tr>

<tr>
<td class="org-left">Sentence</td>
<td class="org-left">m-a</td>
<td class="org-left">m-e</td>
</tr>

<tr>
<td class="org-left">Line Beginning/end</td>
<td class="org-left">c-a</td>
<td class="org-left">c-e c-e</td>
</tr>

<tr>
<td class="org-left">Word</td>
<td class="org-left">m-b</td>
<td class="org-left">m-f</td>
</tr>

<tr>
<td class="org-left">Character</td>
<td class="org-left">c-b</td>
<td class="org-left">c-f</td>
</tr>
</tbody>
</table>

<p>
Daunting?  Well, at first glance they can be but, here's a mnemonic
device for you:
</p>

<ul class="org-ul">
<li>previous, next;  back and forth:  Previous and next line, back and forward word and char.</li>
<li>The c-hick is smaller than its m-other:  Meta makes analogous control key combinations do bigger things.  m-f moves forward a word where as little c-f moves forward a character.  Get it?</li>
<li>A beginning is usually to the left of the end:  c-a is the beginning of the line and c-e is the end of it.  (Note, Emacspeak uses c-e as a prefix, so you have to hit it twice to make it work right.)</li>
</ul>

<p>
And, c-v and m-v are kind of to be learned on your own.  It's not
because of any special reason other than that I haven't been able to
come up with anything clever by which to remember them.  If you can,
please let us know and we'll stick it in here.  v stands for vertical
is about as far as I've gotten.
</p>
</div>
</div>

<div id="outline-container-org8086c6b" class="outline-4">
<h4 id="org8086c6b"><span class="section-number-4">1.5.2.</span> Reading Commands</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Here are some basic reading commands.  Please note that this is not an
exhaustive list.  There are many more.  Use c-h c-e to access the help
file containing them.  These let you read parts of the screen without
moving your cursor:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">element</td>
<td class="org-left">previous</td>
<td class="org-left">current</td>
<td class="org-left">next</td>
</tr>

<tr>
<td class="org-left">Buffer</td>
<td class="org-left">--</td>
<td class="org-left">c-e B</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">window</td>
<td class="org-left">c-e c-p</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">c-e c-n</td>
</tr>

<tr>
<td class="org-left">line</td>
<td class="org-left">c-e up arrow</td>
<td class="org-left">c-e l</td>
<td class="org-left">c-e down arrow</td>
</tr>

<tr>
<td class="org-left">word</td>
<td class="org-left">--</td>
<td class="org-left">c-e w</td>
<td class="org-left">--</td>
</tr>

<tr>
<td class="org-left">Char</td>
<td class="org-left">--</td>
<td class="org-left">c-e c</td>
<td class="org-left">--</td>
</tr>
</tbody>
</table>
</div>
</div>
