info/tutorial.org
***  Other commands

Commands for moving through and reading files are not the only
commands you will need in Emacspeak.  Here are a few other useful
commands for you.  Remember, if you don't feel up to memorizing them
yet, you do have a nice menu bar to fall back on if you need it which
you can reach through alt plus grave or f10.  Here we go:

+  Open a file:  c-x c-f  ::  This command will put your cursor after
   the ~/ which starts all file and directory names inside your home
  folder.  If you want to create a new file, simply type in its name
  and press enter.  If you want to "visit" a pre-existing file, either
  type its name or arrow down through the list of files and
  directories in your home directory and press enter on it when you
  hear its name spoken.
+  Save your current file:  c-x c-s  :: Works very much like a control s in Windows or Gnome.  If you have auditory icons turned on, there's a neat little bleep unique to this key binding's function. 
+  Save as:  c-x c-w  ::  The w stands for "write" a file.
+  Buffer list:  c-x c-b  ::  This is very handy.  It will give you a list
  of all the buffers you have opened during the current session.  Use
  it like you would a task bar or window list.  Arrow through the
  different choices and press enter to change the focus to the one you
  want.  An example of when this is useful is when you are browsing a
  help file and then want to get back to where you were.  The buffer
  list will get you there.  A slightly different way to accomplish
  this is through c-x b as well.
+  Kill buffer:  c-x k  ::  This has a clumsy equivalent in alt f4 in
  Gnome and Windows environments.  You kill the buffer you are on and
  it no longer becomes accessible to you for anything.
+  Search forward and backwards:  c-s and c-r respectively  ::  Highly useful commands.  These will let you type in a
  string and actually start jumping you to the place you want as you
  are typing.  Press an arrow key when you think you are at your
  destination and read the line with c-e l to confirm.  I love these
  commands because they help with rapid navigation in a file or buffer
  and work absolutely everywhere including shells and directories.
+  Move to other window: c-x o ::  Some modes will split your screen
     into several regions called windows and display either part of
  your current buffer or other buffers in those windows
  simultaneously.  The Emacs Code Browser is a good example of a mode
  that does this.  The c-x o command helps you move your cursor to
  these different windows.
+  One window only:  c-x 1 :: if something has split your screen into
     more than one window as described in the previous command, the
  c-x 1 will get rid of those other windows and only have one appear
  on the screen.  The data those other windows held is still there,
  it's just not displayed.
+  emacs command:  m-x  ::  Everything bound to a hotkey is actually a
  function or program which you can invoke directly by name.  For
  instance, c-h i pulls up the help system of Emacs.  To invoke it
  directly, type m-x and, at the prompt, type info.  You can launch
  lots of modes or applications from the m-x prompt.  It's even
  browsable.  Have a look with your up and down arrows.  When you get
  tired of it, use the following command I will show you.
+  quit:  c-g  ::  This command works about like the cancel buttons you find in
  Gnome and Windows.  It aborts just about anything.
+  Exit Emacs:  c-x c-c  ::  This is very important!  It does what you
  would expect.  Before Emacspeak goes away, it will ask you if you
  want to save the file you have been working on if applicable and it
  will always ask you if you want to kil the "active processes" that
  exist.  You will need to actually type out yes on that one not just
  y.

*  Configuration 
Configuring Emacs and Emacspeak involves several things.  You may want
to add more extensions, change how it talks, and change how it behaves
in certain situations.  You might also want to change how it loads
when you launch Emacspeak.  We will discuss all of these next.

**  Setting up your environment 

This section talks about how to set up how Emacspeak speaks to you and
how to make it present information for you in certain ways.  Before
you can customize it though, you need to edit the shell script that
launches Emacspeak found in /usr/bin/emacspeak.  To do this, type the
following at a terminal:

#+BEGIN_EXAMPLE
sudo gedit /usr/bin/emacspeak #+END_EXAMPLE Once that's done, arrow
down till you get to the part that begins to talk about exporting to
unary mode.  You need to get rid of those lines.  Do this either by
commenting them out with a # sine or by just deleting them altogether.
Unary mode isn't necessary for Emacspeak anymore and it will slow your
system down some.  Next, find the line that begins with execute emacs
-q -l followed by a path to the emacspeak file in the /usr/share/emacs
directory.  You need to get rid of the -q flag since this will prevent
you from being able to customize your Emacs at all.  If you want to
play it safe, comment the line out then select, copy and paste a copy
of it underneath and just delete the -q from that one. When you are
done, save your changes and you are ready to customize.

***  Voice rate, punctuation level and key echo 
Hopefully, your distribution came with emacspeak more or less
preconfigured for use without a setting turned on that totally drives
you crazy.  Even still, you will want to learn to customize it.
Honestly, the fastest way you will find to customize Emacspeak is to
edit your .emacs file (it's like an ini and a config file rolled into
one for Emacs), and put your settings there.  This, however, will
involve learning some Emacs Lisp, the language Emacs is partly written
in, and can be a bit heavy going for a new user.  Fortunately, an
alternative method exists.

