info/tutorial.org
**  Customizing Emacs using Easy Customizations

As I mentioned previously, the fastest way to customize your Emacspeak
installation is by editing your .emacs file and setting all sorts of
variables and instructions there.  This requires that you either find
a code snippet to paste into it and hope that the person who claims
that it works is correct or learning Emacs LIsp yourself.  A much
easier, if time consuming alternative is to use the Easy
Customizations section of Emacs to do this.  You get there by typeing
m-x customize or by hitting c-e cap b from anywhere within Emacs. c-e
cap c takes you directly to the Emacspeak section of the truly massive
customizations area. It's hard to explain how this thing works. You
get a page with links on it representing "groups".  Pressing enter on
these groups takes you deeper into the section in question. You then
arrow around to find the settings you want to save and do it either by
hitting space bar in certain areas, setting things to t (on) or nil
(off) in certain places or, in still others, by typing numbers or
letters and things.  Each group is read in a lower voice by Emacspeak
indicating that you can press enter on it to interact with it. Most of
the buffer is read- only except for the places which are usually at
the end of lines where you can add values. You will use c-e c-e (move
to end of line) a lot in there. Another handy thing to get real
familiar with quickly is c-s and c-r. c-s is search forward and c-r is
search backward. Both will start moving the cursor as you type until
you land where you want to be. Hitting your arrow keys makes the
search entry field go away and lets you interact with Emacs at
whatever point you told it to take you to. It's the only sane way to
navigate this area once you know what you are looking for. The
important thing to search for is "save for future sessions". It should
be obvious what that does. Please be prepared to spend a lot of time
familiarizing yourself with this part of Emacs.  Once you get the hang
of it, though, it's pretty quick especially if you use the search
functions described above.
 
Here's what to expect when you launch it for the first time.  To
access the Emacspeak-specific section of the rather large
customizations area, type c-e c- cap c.  You should find yourself in
the customizations buffer.  type c-n a bit to move down a few lines.
Listen carefully to the instructions to this part of Emacs as they are
pretty self-explanatory.  Each item in brackets can be interacted with
either by pressing enter or by typing in the field to the right of it.
Use your movement commands liberally.  To change speech, the [tts]
group will be the place to go.  Once you are done with your
customizations, go to the top of the buffer with m-< and arrow or c-n
down to the line that contains the option to save for current or
future sessions and the exit button. Or, you could cut right to the
chase by typing c-r to search backwards and then typing save for
future sessions.

 If you would like a much better and more in depth explanation of this
 feature of Emacs, I urge you to visit the
 [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Easy-Customization.html][chapter
 dedicated to Easy Customizations]] in the Emacs Manual.

**  Configuring Emacspeak on the fly

If you don't want to mess around with the Easy Customizations section
just now and just want to do some on-the-fly changing, here are some
hotkeys that you can use to do this.  Note that putting c-u before all
of these makes the changes Emacswide.  Otherwise, you'll change
Emacspeak's speaking behavior local to your current buffer.

+  Turn off verbal or "split" capitalization announcement:  c-e d s
+  Turn on capitalization announcement by pitch:  c-e d c
+  Turn on capitalization announcement with a short click (my favorite):  c-e d cap C  (the c is capitalized on this one)
+  Change punctuation level:  c-e d p and then type none, some most or all whichever you want.
+  Change speech rate:  You can do this in two ways.
  -  Preset levels: c-e d  and then any number from 0-9
  -  Words per minute specification:  c-e d r and how many words per minute you want.  I keep mine at 350 so, I typed c-e d r 350 and hit enter to do this.



***      Audible Icons 

As mentioned before, audible icons are sounds associated with behavior
such as pulling up menus, toggling something on or off, moving to the
beginning or end of a file and changing screenfuls of ext with c-v
m-v.  If you used Jaws in Windows (lots of folks do since at the time
of this writing, it's the most popular screen reader in the most
popular operating system), you know this concept by the name of Sound
Schemes.  to turn on these audible icons, use c-e c-a.  to turn them
on globally, type c-u c-e c-a.


***  A sample of a .emacs file's contents


Earlier, I told you that the easiest and fastest way to change your
settings is by changing what your .emacs file contains.  Here is a
snippet from mine which makes your caps indicated by a clink, your
speech rate at 250 wpm, your punctuation level most, and word and char
echo off but line echo on.  Copy and paste this exactly as I have it
here and you should be ok.  If you want word echo on instead of line
echo, change the t to nill and vice versa for the applical line item.:

#+BEGIN_SRC emacs-lisp

 '(emacspeak-character-echo nil) '(emacspeak-line-echo t)
 '(emacspeak-word-echo nil) '(espeak-default-speech-rate 250)
 '(line-number-mode nil)) (dtk-toggle-split-caps t)
 (dtk-toggle-allcaps-beep t) #+END_SRC emacs-lisp

**    Adding pluggins or extensions

There are two ways to add extensions to your Emacs which we will
discuss.  There are more but these are the easiest.  Remember, this is
for newbies to learn Emacspeak.  These two ways are through the
[[http://www.nongnu.org/synaptic/][synaptic package manager]] and
through the Emacs Lisp Package archive or
[[http://tromey.com/elpa/][Elpa]] as it is called for short.  The next
two sections will show you how to add packages and extensions to your
Emacs using these two solutions.


***  Adding packages through Synaptic  

Many of the extensions that have been written for Emacs can be added
through Synaptic inside of Gnome.  Just bring it up and type control f
for find and type in emacs.  Press enter and wait for a bit and it
will only show you the packages which are related to emacs.  Tab a few
times till you hear Orca say "s column header".  Now, arrow down to go
through the list.  Arrow left and right to move from column to column
such as package name, installed version, latest version and
description.  When you get to a package you want, mark it by typing
control i.  When you have marked all the ones you want, press control
p to apply changes and tap to apply and press enter.  If you need more
help than this using the Synaptic Package Manager, follow the link
provided in the previous section which will take you to its homepage
where you can learn more about it

