info/tutorial.org
**  Using Elpa  to extend your Emacs

Elpa is a system Emacs uses for downloading and installing extensions.
Some are very large and include several modes while others are small
and may only consist of a minor mode.  As you become more proficient
in Emacs, you will be in a better position to pick which packages you
want for your machine.  In order to make Elpa available, you will need
to paste a bit of lisp code into your scratch buffer.  Here is the
code.  Cut and paste this into an empty text file for later use in
case you ever have to reinstall your Emacs:

#BEGIN_SRC emacs-lisp (let ((buffer (url-retrieve-synchronously
  "http://tromey.com/elpa/package-install.el"))) (save-excursion
  (set-buffer buffer) (goto-char (point-min)) (re-search-forward "^$"
  nil 'move) (eval-region (point) (point-max)) (kill-buffer
  (current-buffer)))) #+END_SRC Ok, here's what you do:

1.  Inside gnome, open up the text file you pasted this into with gedit and copy the code into your clipboard.
2.  Get out of gedit and go to a gnome terminal with control alt t.
3.  Kill orca with orca + q.
4.  Type emacspeak and press enter to bring up emacspeak.
5.  Get to the scratch buffer with c-x c-b and arrow keys, pressing enter when you hear  it mentioned.
6.  Press m-> to get to the bottom of the buffer.
7.  Bring up the edit menu by first hitting f10 to bring up the menu bar or alt+` whichever you prefer and then arrowing down to edit.  Press enter here
8.  First option should be paste.  Arrow up and down a couple of times because you don't want to confuse it with Paste from Kill Menu.  Once you have established that it's paste, press enter.
9.  Your elpa code should be there now.  Go to the bottom of the buffer with m-> an press left arrow till you are placed just after the last parenthesis.  
10.  Press c-j to evaluate or run the code.  You will then get a new buffer which is the elpa package list come up after a few moments.

Once you have elpa installed, just arrow up and down through the list
of packages and type i next to the one you want to install.  Do that
till you have made all your choices and then type x to have it
download and install them.  When you are done, type c-x c-c to close
Emacs and then bring it right back up again either in console or in
gnome according to your preference and you should have the new
packages you wanted installed and ready for use.

I am going to recommend that you install three packages right off the
bat.  These are Facebook, twitter and w3.  Place an i before the name
of each of these as instructed above and then, after the last
selection, press x and give Elpa a few moments to install these.  The
first two are self-explanatory.  The third package is a web browser
for Emacs.

*   Putting it to use. 
Now that we have our emacspeak all set up the way we want it, let's
make it do something for us.  The following sections can be read
independently.  They have been written so as not to build on one
another too much.  This way, a newcomer to Emacspeak can pick what
they want to accomplish first to get their feet wet.  Remember to
refer to the hotkey list described in prior sections for help
navigating them.  I suggest you try every one of these at some point.
You will then get a very good idea of the potential emacspeak has.
Remember to make heavy use of the info pages and the key describers
discussed in the section on getting help.  Also, never forget that
Google is your friend.  Emacs runs primarily on Linux and Unix
systems.  The internet began its life on Unix systems for the most
part and Linux grew up with the Internet in its modern form and is
available in dozens of flavors each with their own web pages and
documentation, forums, mailings and so forth.  What this means to you
is that there are tons and tons of web resources for Emacs for you to
consult.  Use them to the fullest extent possible.


**  First Launch of Emacspeak

Let's back up a bit and describe what you can expect when you launch
Emacspeak for the first time.  The very first time you launch it from
your console or terminal, you will hear e-speak load up first and then
Emacspeak will tell you that it is "fully operational" and all its
"circuits are working perfectly."  You will then find yourself on a
screen that is the Emacs welcome page.  Move around on it a bit with
c-n and c-p.  You will hear it announce the Emacs Tutorial and link to
Browse the Emacs Manual very early on.  If you want to take this
moment to explore these resources, by all means do so.  You may find
it very fascinating and enjoyable to explore this new application in
as safe a manner as this.  Whenever you are done exploring Emacspeak
and just want to quit, type c-x c-c.  You will get a prompt that says:

"Active processes exist.  Kill anyway?"

type "yes" all the way out and, of course, without the quotation marks
I'm using for grammatical effect.  You will then find yourself back at
the command prompt where you started.

