info/tutorial.html

<div id="outline-container-orgd9d5e30" class="outline-3">
<h3 id="orgd9d5e30"><span class="section-number-3">2.5.</span> Using Elpa  to extend your Emacs</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Elpa is a system Emacs uses for downloading and installing extensions.
Some are very large and include several modes while others are small
and may only consist of a minor mode.  As you become more proficient
in Emacs, you will be in a better position to pick which packages you
want for your machine.  In order to make Elpa available, you will need
to paste a bit of lisp code into your scratch buffer.  Here is the
code.  Cut and paste this into an empty text file for later use in
case you ever have to reinstall your Emacs:
</p>

<p>
#BEGIN<sub>SRC</sub> emacs-lisp (let ((buffer (url-retrieve-synchronously
  "<a href="http://tromey.com/elpa/package-install.el">http://tromey.com/elpa/package-install.el</a>"))) (save-excursion
  (set-buffer buffer) (goto-char (point-min)) (re-search-forward "^$"
  nil 'move) (eval-region (point) (point-max)) (kill-buffer
  (current-buffer)))) #+END<sub>SRC</sub> Ok, here's what you do:
</p>

<ol class="org-ol">
<li>Inside gnome, open up the text file you pasted this into with gedit and copy the code into your clipboard.</li>
<li>Get out of gedit and go to a gnome terminal with control alt t.</li>
<li>Kill orca with orca + q.</li>
<li>Type emacspeak and press enter to bring up emacspeak.</li>
<li>Get to the scratch buffer with c-x c-b and arrow keys, pressing enter when you hear  it mentioned.</li>
<li>Press m-&gt; to get to the bottom of the buffer.</li>
<li>Bring up the edit menu by first hitting f10 to bring up the menu bar or alt+` whichever you prefer and then arrowing down to edit.  Press enter here</li>
<li>First option should be paste.  Arrow up and down a couple of times because you don't want to confuse it with Paste from Kill Menu.  Once you have established that it's paste, press enter.</li>
<li>Your elpa code should be there now.  Go to the bottom of the buffer with m-&gt; an press left arrow till you are placed just after the last parenthesis.</li>
<li>Press c-j to evaluate or run the code.  You will then get a new buffer which is the elpa package list come up after a few moments.</li>
</ol>

<p>
Once you have elpa installed, just arrow up and down through the list
of packages and type i next to the one you want to install.  Do that
till you have made all your choices and then type x to have it
download and install them.  When you are done, type c-x c-c to close
Emacs and then bring it right back up again either in console or in
gnome according to your preference and you should have the new
packages you wanted installed and ready for use.
</p>

<p>
I am going to recommend that you install three packages right off the
bat.  These are Facebook, twitter and w3.  Place an i before the name
of each of these as instructed above and then, after the last
selection, press x and give Elpa a few moments to install these.  The
first two are self-explanatory.  The third package is a web browser
for Emacs.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcb7958d" class="outline-2">
<h2 id="orgcb7958d"><span class="section-number-2">3.</span> Putting it to use.</h2>
<div class="outline-text-2" id="text-3">
<p>
Now that we have our emacspeak all set up the way we want it, let's
make it do something for us.  The following sections can be read
independently.  They have been written so as not to build on one
another too much.  This way, a newcomer to Emacspeak can pick what
they want to accomplish first to get their feet wet.  Remember to
refer to the hotkey list described in prior sections for help
navigating them.  I suggest you try every one of these at some point.
You will then get a very good idea of the potential emacspeak has.
Remember to make heavy use of the info pages and the key describers
discussed in the section on getting help.  Also, never forget that
Google is your friend.  Emacs runs primarily on Linux and Unix
systems.  The internet began its life on Unix systems for the most
part and Linux grew up with the Internet in its modern form and is
available in dozens of flavors each with their own web pages and
documentation, forums, mailings and so forth.  What this means to you
is that there are tons and tons of web resources for Emacs for you to
consult.  Use them to the fullest extent possible.
</p>
</div>


<div id="outline-container-org6ca7ea3" class="outline-3">
<h3 id="org6ca7ea3"><span class="section-number-3">3.1.</span> First Launch of Emacspeak</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Let's back up a bit and describe what you can expect when you launch
Emacspeak for the first time.  The very first time you launch it from
your console or terminal, you will hear e-speak load up first and then
Emacspeak will tell you that it is "fully operational" and all its
"circuits are working perfectly."  You will then find yourself on a
screen that is the Emacs welcome page.  Move around on it a bit with
c-n and c-p.  You will hear it announce the Emacs Tutorial and link to
Browse the Emacs Manual very early on.  If you want to take this
moment to explore these resources, by all means do so.  You may find
it very fascinating and enjoyable to explore this new application in
as safe a manner as this.  Whenever you are done exploring Emacspeak
and just want to quit, type c-x c-c.  You will get a prompt that says:
</p>

<p>
"Active processes exist.  Kill anyway?"
</p>

<p>
type "yes" all the way out and, of course, without the quotation marks
I'm using for grammatical effect.  You will then find yourself back at
the command prompt where you started.
</p>
</div>
</div>
