info/tutorial.org
**  Additional notes

Please note that I always show you how to use Emacspeak from a console
and not from Gnome.  The reason for this is that at the time of this
writing, Orca and Emacspeak don't work well together due to some snafu
with the gtk+ support Emacs has freezing at-spi somehow.  A partial
work-around is to bring Emacspeak up in xterm which Orca currently
doesn't read but, it will still make Orca take a while before coming
back up when you alt tab or control alt right arrow out of Emacspeak
and into something else.  The lock-up can be avoided by putting the
-nw switch in when you bring up Emacspeak but, for some reason, the
meta key is unassigned in this launch and this causes you to have to
use escape as a prefix for everything you normally hold down the meta
key for.  I personally find it annoying and don't use it this way
because it isn't very efficient.  You may not find it so in which
case, feel free to pull emacspeak up in xterm.  To put in the switch I
mentioned, bring it up like this:

1.  From inside gnome, press alt f2 to be prompted which application you'd like to run.
2.  At the prompt, type xterm and press enter.
3.  You won't hear anything other than, perhaps the window title and Orca telling you this place is inaccessible.  Hopefully, you have sound icons turned on in gnome so that pressing down arrow gives you a sort of tom-tom drum sound telling you that you are at the bottom of the terminal window.  
4.  Type emacspeak -nw and press enter.
5.  Begin using Emacspeak as normal.  


Don't use gnome terminal unless you are turning your orca off because
they will both talk at once.  If you are going to do that, kill orca
while you run Emacspeak and don't bother with the -nw switch.  I've
used Emacspeak this way a couple of times but I like having Orca
around for x-windows stuff so, I run my Emacspeak in a virtual
console, tty1 to be exact.  I also like to use speakup in the pure
console environment so, I have tty2 logged in and brought up as well
with speakup not toggled off in it.  I typically have a Gnu Screen
session going in there so I can multitask inside the console but that
is another topic for another day.  Bottom line is, don't ever ever let
one good tool cheat you out of being able to use another.  Avoid the
silly romanticized emotional loyalties people tend to develop for
doing things one way and with one thing.  Watch out for the pernicious
tendencies people have of turning their noses up at perfectly good
software just because they don't like the interface, don't believe in
how the developer deals with his code or other such foolishness most
end users could care less about.  If you are using Emacspeak, it is
because you are visually impaired.  This means that your options for
what kind of software you can use are limited enough as it is.  Don't
hamper yourself further by turning your back on any tool you can use
to get the job done.  We just can't afford that kind of thinking.  Use
the best tool for the job as much as time, resources and inclinations
allow and leave philosophy and idealism to people like Plato and
politicians.  Ok, I'll get off my soap box now.

Bringing up Emacspeak in the console is nice because you can still
have speakup running though in the background and it can be called
upon to read the screen in a traditional screen-reader manner with the
number pad.  To keep speakup from talking over emacspeak, simply hold
down the numpad insert and press numpad enter.  To make it speak the
screen as it changes again, just press that key combination a second
time and it'll toggle speakup back on for you.  All right, now,
without further adieu, let's get started!

*  Manipulating  text
Emacs is the king of editors.  Yes, I know that sounds really pompous
and I suppose it also sounds rather silly but, honest, it's true.  No
other editor can do as much as Emacs can in as efficient a manner and
with as much room for customizations and extensions as this 30
something year-old editor.  The next few sections will feature step by
step instructions on creating files which are, at the core, just text
files but that do many different things.  Here we go!

 
