info/tutorial.html


<div id="outline-container-org2aab56b" class="outline-3">
<h3 id="org2aab56b"><span class="section-number-3">4.1.</span> Your first text file</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In This section will show you how to create and edit your first plain
text file.  If you are used to windows, then you are probably used to
people looking a scance at plain text since there are so many word
processors and other types of solutions for making text look and
behave a certain way.  In Windowsland, you have .rtf's, .doc's,
.wpd's, .pdf's, and all sorts of other extensions denoting all sorts
of files which can only be read by one sort of program or changed by
one sort of program.  The humble .txt file is seen as unsophisticated.
It isn't and these programs use plain text too but with tons of markup
which they hide from you in all sorts of convoluted ways that take
away your control of the file.  In Linux, however, plain text is used
extensively and markups and such are always available for you to see
and understand due to the prevalence of free software and open source
thinking.  The text file can be put to many uses.  We'll really see
one of these uses when we write our first webpage using Emacs's
org-mode but, for now, let's just make a text file.  It will get you
used to editing and movement commands within Emacs.
</p>

<p>
From the command prompt. do the following:
</p>

<ol class="org-ol">
<li>Make a directory from which to work.  So type this:</li>
</ol>
<p>
#+BEGIN<sub>EXAMPLE</sub>
</p>

<p>
mkdir learn-emacspeak
</p>

<p>
#+END<sub>EXAMPLE</sub>
</p>
<ol class="org-ol">
<li>Now, move to it in order to work from there by typing:</li>
</ol>
<p>
#+BEGIN<sub>EXAMPLE</sub>
</p>

<p>
cd learn-emacspeak
</p>

<p>
#+END<sub>EXAMPLE</sub>
</p>
<ol class="org-ol">
<li>Now, we can begin.  Turn Speakup to quiet mode by holding down the numpad insert and pressing enter.  Espeak will say "You turned me off!"  It will hang around in the background and can be accessed using your number key pad but it won't announce changes in the screen anymore.  If you just want Speakup out of the picture, press print-screen and it will kill it.  Press print screen again to bring it back to life.</li>
<li>The moment of truth is upon us!  We're going to bring Emacspeak up with a text file.  You do this by typing the following into a command prompt in the console:</li>
</ol>
<p>
#BEGIN<sub>EXAMPLE</sub> emacspeak firstfile.txt #+END<sub>EXAMPLE</sub>
</p>

<p>
Emacspeak will come up and you will be in an empty file buffer.  Type
a few lines.  For instance:
</p>

<p>
#+BEGIN<sub>EXAMPLE</sub>
Mary had a little lamb Whose fleece was white as snow.  And everywhere
that mary went, The lamb was sure to go!  #+END<sub>EXAMPLE</sub> Use the
movement keys taught to you in prior chapters of this tutorial to move
around this file.  Move around by character, word, and sentence.  If
you decided to type many more lines, you can move by screenful by
scrolling vertical with c-v and m-v.  Here are a few editing commands
for you:
</p>
<ul class="org-ul">
<li>Delete character:  c-d</li>
<li>Delete word: m-d</li>
<li>Delete or kill line:  c-k</li>
<li>Paste what you just deleted back into another part of the document:  c-y  (y stands for yank)</li>
</ul>

<p>
Other exercises:
</p>
<ul class="org-ul">
<li>Press m-&lt; and m-&gt; to go to the top and bottom of your file.</li>
<li>Use c-e B to read your entire buffer.  it will ask you if you want
to read the whole thing or read from start to point or from point to
end.  It's pretty self explanatory.  To use fewer keystrokes, you
can use c-e n to read from point forward.</li>
<li>Press c-n a few times to go to a line of your file further down and practice reading the prior line with c-e up arrow.   Read the current line with c-e l.  Find out the current line number with c-e e-l.</li>
<li>Explore the menus in plain text mode to find other functionality.</li>
</ul>

<p>
One thing to note is that Emacs has word wrapping set to off by
default.  If you are going to write a lot of pros, you'll want to
access the options menu and arrow down to "Auto fill in text modes"
and press enter.  Your lines will wrap from that point on.  Don't get
taken in by the actual word wrapping features because they just
wordwrap for visual effect.  Emacspeak won't be fooled and will treat
your text as single line paragraphs.
</p>

<p>
When you are done with your file, Press c-x c-s to save your changes.
</p>
</div>

<div id="outline-container-org1088c2f" class="outline-4">
<h4 id="org1088c2f"><span class="section-number-4">4.1.1.</span> But wait!  What about spell checking?</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Ok, so now that we have finished typing our text file and we've saved
it, we don't want to just leave it like that.  There might be typos in
there!  Or, you might have just slipped up and forgot to double a
consonant, lengthen a vowel or something like that.  To remedy this
situation, Emacs has a spell checking mode you can turn to.  From
anywhere in your file type m-x ispell-buffer.  Emacspeak will read the
sentence or line of any misspelled word and use a lower voice to
pinpoint the misspelled word for you.  You are then given a list of
choices to choose from.  It's pretty straightforward.  If you get
stuck, just type a question mark and you will get a nice help file
spoken telling you what to do.  Once you are done spellchecking, hit
c-x c-s to save and you are set.
</p>
</div>
</div>

<div id="outline-container-orgb2f261f" class="outline-4">
<h4 id="orgb2f261f"><span class="section-number-4">4.1.2.</span> Visiting files</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
To edit a new file from an already running emacs session or to open a
file you had edited previously, type c-x c-f.  YOu will be placed
after the ~/ which tells Emacs to visit or create a file in your home
directory.  If you are pulling up our little text file at some future
point, we would type learn-emacspeak/firstfile.txt.  Of course,
there's also completion.
</p>

<p>
If you don't remember the exact string to type to get to a file, type
the beginning of it and then tap to get emacs to generate a completion
list.  Then, type page up to put you into the completions buffer where
you canarrow up and down to pick your completion.  Sometimes, you get
more than one file at a time on a line so use left and right arrows to
get to other files on such lines.  That's all there is to it!  You now
know enough to get you started writing text files.  Use that menu bar
when you get stuck and then learn those hotkeys by browsing the help
files as you go along.
</p>
</div>
</div>
</div>
