info/tutorial.org
**  Let's make a webpage!

I am now going to teach you how to write your own homepage using
Emacspeak without knowing a single solitary lick of css or html code.
Your homepage will be accessible, structured and usable with just
about any browser out there.  You'll be able to save it to a thum
drive and put it onto any machine you use regardless of platform and
it will work for you no matter what screen reader you use.  And, my
friend, we will do this in just a few short minutes.  Don't believe
me?  Watch and learn!

We are going to use a built-in mode of Emacs called org-mode.  It is
used for all kinds of things like planning agendas, scheduling,
writing notes and authoring.  You can take what you write in this mode
and have it spit it out to a structured ascii text file, an html file,
a LaTx file a pdf file and, of course, an html file which is what we
will be doing.  Let's get started!  Note: You can get more information
about org-mode and all its many uses by browsing the online manual by
following this link: [[http://orgmode.org/manual/index.html][online
version of the Org-Mode Manual]].  If you are in Emacs, you can also,
of course browse this documentation using info.  From the command
prompt. do the following:

1.  If you haven't already, make a directory from which to work.  So type this:
#+BEGIN_EXAMPLE
mkdir learn-emacspeak #+END_EXAMPLE
2.  Now, move to it in order to work from there by typing:
#+BEGIN_EXAMPLE
cd learn-emacspeak #+END_EXAMPLE
3.  Now, we can begin.  Turn Speakup to quiet mode by holding down the numpad insert and pressing enter.  Espeak will say "You turned me off!"  It will hang around in the background and can be accessed using your number key pad but it won't announce changes in the screen anymore.  If you just want Speakup out of the picture, press print-screen and it will kill it.  Press print screen again to bring it back to life.
4.  Type emacspeak myhomepage.org at the command prompt and press enter.


You are in an empty buffer in Emacs running org-mode.  Before we write
a single line of text, let's turn autofill mode on by going to the
options menu with either alt plus grave or f10 and arrowing down to
it.  Autofill should be one of the first things you hear while
arrowing down.  This will word wrap our lines for us.  Now, on to our
homepage!

Let's first create the structure of our page.  We will use 3 headings,
personal, technical, and other.  We can do this in three ways.

+  Using the menu bar:  Press f10 or alt+` to bring up the menu bar and arrow down to org mode's menu.  Press enter.  From here, arrow down to "new Heading" and press enter.  Now, type your heading name and press enter.
+  With a hotkey:  Press c-j and then type your heading name.  When you are done, press enter.
+  Markup tags:  This is my favorite way as I can do it quickly and on the fly.  Type an asterisk and then space twice.  Then, type in your heading name and press enter.

Pick a method and create the heading names I assigned you above.

***  Fil in the Sections

Ok, now, we flesh out our page.  Using your arrows or c-p and c-n, get
to the first one called "personal."  You will notice that it is
preceded by an asterisk.  Type c-e c-e to get us to the end of the
line and press enter.  Now, type something brief to remind yourself of
what's in this section.  Something like this:

This section contains my personal information links such as my e-mail
page, my bank's page and my social accounts pages like Linked-in,
twitter and Facebook.

Press enter twice and let's get ready to make our links.

