info/tutorial.html

<div id="outline-container-orgeb278e5" class="outline-4">
<h4 id="orgeb278e5"><span class="section-number-4">4.2.2.</span> Creating Links</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
As in the case of headings, there are three ways to put links into
your homepage with org-mode.  Really, there's more than this but, we
are trying to keep it simple so we will restrict ourselves to three.
</p>

<dl class="org-dl">
<dt>Using the menu bar: </dt><dd>Again, we hit f10 or alt grave and arrow down to org's menu and press enter.  Then, we arrow down to "hyperlink" and press enter again.  We are now in a submenu.  Arrow until you hear "Insert hyperlink" and press enter.  From here, we have a list of different sorts of links to choose from.  If you explore a bit, you will find http, https, ftp, sendmail and many more which are far too many to list here.  Arrow down to <a href="http://">http://</a> and enter the url of the page you are linking to.</dd>
</dl>
<p>
Example:
#+BEGIN<sub>EXAMPLE</sub>
www.vinux-project.org
</p>
<p>
#+end<sub>EXAMPLE</sub> Press enter again and you are at a point where you can
enter a description.  This is where you enter the text you want to
hehar telling you what that url is to.  Along the same vein as our
example: Vinux home page.
</p>
<dl class="org-dl">
<dt>A hotkey combination: </dt><dd>To add a link using hotkeys, we use the c-c prefix and then c-l.  So, c-c c-l and we are in the list of url types again.  Proceed as outlined above at this point.</dd>
<dt>Using the link markup codes:</dt><dd>Again, this is my personal
   favorite since I don't really like to interrupt my typing to mess
with menus and lists and things.  To add a llink this way, we put in
square brackets.  This is a square bracket: [.  You want two left
square brackets one after the other.  Then we put the url in.  Next,
we put in a right bracket to close the pair containing the url and
follow it with a left square bracket. Here, we type the link's
description.  When the description is finished, we put a right
square bracket to close the description field and another to close
the link addition.  When you press enter now, you have a link in
your page!  You can test the link by arrowing up to it and noting
that Emacspeak speaks it in the lower voice designated for links.
You can also follow the link.  You can either do that with the menu
bar or with the c-c c-o hotkey.</dd>
</dl>

<p>
Here is an example of some links you can put in your page's personal
section:
#+BEGIN<sub>EXAMPLE</sub>
</p>
<p>
<a href="http://gmail.google.com">Check your Gmail account</a>
<a href="http://www.twitter.com">Browse my Twitter page</a>
<a href="http://www.facebook.com">My Facebook Page</a>
<a href="http://www.sourceforge.net">Check my Source Forge Account</a>
#+END<sub>EXAMPLE</sub>
</p>

<p>
We can put the links in a list.  It's really easy.  Just precede every
line of your list with a plus sign and two spaces and then your
beginning brackets or the insertion of the link and the links will be
formatted into a list for you.  Another way to do it is in a table.
Each cell is separated by pipes or vertical bars.  This is a pipe: |.
For further guidance in creating tables in org-mode, consult the
org-mode documentation online or through the info pages.  I like lists
because they are easy to navigate with Orca and Jaws.  Suggestions for
the personal heading are a link to gmail.google.com, twitter.com and
to your bank or something like that.  Mine has my gmail, rfbd, my
retirement account, and Linked-in since that's the only thing even
approximating social networking that I do.
</p>

<p>
To go to each subsequent heading level in the file you are writing,
type c-c n for next and c-c p for previous.  Put your cursor at the
end of each line with c-e c-e and press enter to get into where you
can edit.  You can fold headings where the stuff inside each of them
is tucked away form view for you so the document tree is browsable and
you can read the big picture.  Makes authoring real easy, I can tell
you.  I'm using org-mode to write this tutorial, as it happens.  To
fold, you get to the line containing the heading and backtab.  To
unfold and read the heading's contents, press tab.  When headings are
folded, emacspeak will announce them as such in auditory icons with a
sort of clicking or clapping sound.  Try it out.  It's pretty neat.
when you unfold one, emacspeak will tell you that you can view the
heading's children.
</p>
</div>
</div>



<div id="outline-container-org1d6f9fe" class="outline-4">
<h4 id="org1d6f9fe"><span class="section-number-4">4.2.3.</span> Exercise:</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Now, it's your turn.  Using the example above, fill in the rest of
your personal links, put in some technical links like the Vinux
homepage, the Emacspeak homepage, the Orca page ETC.  Then, in your
final heading, put in some other links of interest to you.
</p>
</div>
</div>


<div id="outline-container-org10a9d53" class="outline-4">
<h4 id="org10a9d53"><span class="section-number-4">4.2.4.</span> Exporting to html</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
So, now we have our homepage all written up and we are ready to export
it.  Again, you can do this with the org menu bar which you should
know how to get to by now or by typing c-c c-e.  You will be asked to
enter a command.  This is where you have the choice to export to all
sorts of other formats.  I'll let you explore those on your own.  For
now, just type h for html.  YOu will be asked for a document title.
Mine says, strangely enough, Alex's homepage. Title yours as you want
and then press enter.  Now, either open up another tty virtual console
or alt f7 to go into Gnome and get to a terminal and navigate to your
learn-emacspeak directory.  Perform an ls command to list the files in
the directory and you should hear the html file in there.  To test it,
launch your favorite browser and see how all the links work nicely.
</p>

<p>
Congratulations!  You have just written your first webpage using
Emacspeak.  Pretty easy, right?  To continue your learning experience,
have a look at the org-mode documentation which you can get to through
info or the org-mode menu and find out about all the other amazing
things this litttle gem inside of Emacs can do for you.
</p>
</div>
</div>
</div>
