info/tutorial.org
**  Let's write some code! 

No document pretending to explain to someone how to use Emacs and
Emacspeak would be complete, in my opinion, without some instructions
on coding.  Writing programs is one of Emacs' primary function among
many of its users.  It's got a mode for just about every language.
For our purposes, we will use the c-mode which is the one for c and
c++ and other languages related to it.  Don't worry if your language
is different, all of the concepts I will explore in this brief
tutorial are common to all programming languages.  I just happen to
know c++ so, it's what I used.  If you know Python, Perl, Shell
Script, Java or something like that Emacs has you covered.  Just
replace the .cpp extension with the one corresponding to your language
and chances are, Emacs will have a mode for it pre-installed and come
up for you in that mode.  Here we go:

If you write code, I'm going to assume you know how to use a command
line.  If you don't and you want to code in Linux, learn it as soon as
you can.  This section has the least amount of hand holding since, if
you program, you need to be willling to explore more than your average
user.

1.  Make a directory called learn-emacspeak in your home directory.
2.  Navigate to that directory from inside a console.
3.  Toggle speakup off with numpad enter.
4.  Launch emacspeak with the command emacspeak program1.cpp.


You are now inside an empty buffer in Emacs's c-mode.  Emacspeak will
act rather differently here than in other environments.  Let's write a
short program to demonstrate.  We will have some comments, some
include or, what you might know as import statements, a fiew variables
and a function.  Notice how emacspeak's voice changes according to
context.  Write these lines exactly as shown here:

#+BEGIN_SRC c++
// This is a comment in c++ // It should be spoken in a monotone
voice.  // You can't miss it.  // notice how it treats header file
inclusions next #include <iostream> #include <string> // Here's our
function int main () { // Now, an object of type string and its
initialization std::string howdy = "Howdy, partner.  This is emacspeak
talking to you!"; int a, b, c; // Some variable declarations.  a = 1,
b = 2, c = 3; // Assigning them values std::cout << howdy << "\n Let's
count to three: \n" << a << b << c; // Print some text using console
out in c++.  return 0; // We end our program.  } #+END_SRC

To save our work, we type c-x c-s.  Now, explore the file using c-p
and c-n and then go by words with m-f and m-b.  Some new keys that are
specific to this mode are m-p and m-n which move you to the previous
and next statement respectively.  Make some changes to the comments.
Use c-d for character deletion, m-d for word deletion and c-k for
deleting a whole line.  c-y "yanks" the line back from being killed.
It's Emacs talk for paste.

Have a look at the c-mode menus that are added to the menu bar by
hitting f10 or alt + grave.  When you do the next exercise, notice how
they are different in the mode for your own language.  The cc-mode has
a lot of other functionality but it is something best explored on your
own since it is only of interest to you if you code in c++ and
explanations of how that is done are way beyond the scope of this
tutorial.  Another thing to look at is the list of hotkeys specific to
it by typing c-h m and then moving to the help buffer with c-x o.
Incidentally, c-h b will give you a more compact list of hotkeys.


***  Exercise:

From a command prompt, launch emacspeak with a new program in a
language you are familiar with like Python.  Explore how Emacspeak
will talk in certain situations and with certain elements of code.

*  Onto the wide wide world: 

Emacspeak lets you have access to all elements of the internet.
Whether it's e-mail, the web, chatting with Irc, social networking
with Facebook and Twitter or reading your favorite newsgroups, it can
all be done from within Emacs and Emacspeak has been written with
support for this functionality.  We will explore some of this in the
next few sections.


**      How about a chat? 

Chatting with Emacspeak is truly a breeze.  You won't believe how easy
it is.  The best way to illustrate that is to show you how you would
chat on the Vinux irc channel.  Here's what you do:

1.  Launch Emacspeak from the command prompt with speakup toggled off by pressing insert + numpad enter.
2.  Once it's up, press m-x and then type erc and press enter.  Note the spelling, please, it's not a typo.
3.  Answer the prompts such as the irc server, the port (best left as default) and then the nickname you want to log in complete with any applicable password.  Press enter after each entry.  This will get you onto the irc server from which you can then join a channel of your choosing. 
Example:
|Irc Server|irc.blufudge.net|
|port|6667|
|Username|AlexM|
|Password| Gobbldy-gook|

Give it a few moments and it should tell you that you are on the
server you chose.  At this point, things get pretty straightforward
because now, you can use the menu bar which can be reached with f10 or
alt grave accent and arrow to the erc-mode menu and press enter.
Choose an option such as joining a channel and then type in the
channel you want to join.  Another way to do this is to just type
/join #channelName as you would in any other irc client.  All the
usual irc commands work here.  the menu bar contains a few helpful
shortcuts for when you don't know them but you can get away without
ever visiting it.

***  Actual chatting tips

Once you have joined a channel, you will want to monitor it so you
know what people are saying.  To do this, type c-c c-m.  This will
monitor your current channel.  If you have auditory icons turned on,
you will get a little sound preceding every message someone types.
To talk to someone, just type what you want to say and press enter.
You'll hear a little ding if you have auditory icons but not the text
you typed.  To get past this, I usually turn on line echo locally with
c-e d l.

You can have multiple channels at a time which you are monitoring.
Personally, I have no idea why someone would want to do this but, I'm
sure there are reasons out there for wanting to do this.  If you have
such a reason, each channel is in its own buffer.  All you have to do
to switch back and forth between channels you are on is to go to the
buffer containing that channel and its conversations by hitting c-x
c-b for the buffer list, arrowing down to the buffer in question and
hitting enter on it.  Once you are done chatting, just use /leave to
leave the channel you are on or go to the menu bar and find the leave
command in the erc-mode menu.  Once you've done this, you can either
disconnect from the server or just kill the buffer you are on to stop
your erc session.  And that's all there is to it!


