info/tutorial.html



<div id="outline-container-org7f74080" class="outline-3">
<h3 id="org7f74080"><span class="section-number-3">4.3.</span> Let's write some code!</h3>
<div class="outline-text-3" id="text-4-3">
<p>
No document pretending to explain to someone how to use Emacs and
Emacspeak would be complete, in my opinion, without some instructions
on coding.  Writing programs is one of Emacs' primary function among
many of its users.  It's got a mode for just about every language.
For our purposes, we will use the c-mode which is the one for c and
c++ and other languages related to it.  Don't worry if your language
is different, all of the concepts I will explore in this brief
tutorial are common to all programming languages.  I just happen to
know c++ so, it's what I used.  If you know Python, Perl, Shell
Script, Java or something like that Emacs has you covered.  Just
replace the .cpp extension with the one corresponding to your language
and chances are, Emacs will have a mode for it pre-installed and come
up for you in that mode.  Here we go:
</p>

<p>
If you write code, I'm going to assume you know how to use a command
line.  If you don't and you want to code in Linux, learn it as soon as
you can.  This section has the least amount of hand holding since, if
you program, you need to be willling to explore more than your average
user.
</p>

<ol class="org-ol">
<li>Make a directory called learn-emacspeak in your home directory.</li>
<li>Navigate to that directory from inside a console.</li>
<li>Toggle speakup off with numpad enter.</li>
<li>Launch emacspeak with the command emacspeak program1.cpp.</li>
</ol>


<p>
You are now inside an empty buffer in Emacs's c-mode.  Emacspeak will
act rather differently here than in other environments.  Let's write a
short program to demonstrate.  We will have some comments, some
include or, what you might know as import statements, a fiew variables
and a function.  Notice how emacspeak's voice changes according to
context.  Write these lines exactly as shown here:
</p>

<p>
#+BEGIN<sub>SRC</sub> c++
<i>/ This is a comment in c++ /</i> It should be spoken in a monotone
voice.  <i>/ You can't miss it.  /</i> notice how it treats header file
inclusions next #include &lt;iostream&gt; #include &lt;string&gt; <i>/ Here's our
function int main () { /</i> Now, an object of type string and its
initialization std::string howdy = "Howdy, partner.  This is emacspeak
talking to you!"; int a, b, c; <i>/ Some variable declarations.  a = 1,
b = 2, c = 3; /</i> Assigning them values std::cout &lt;&lt; howdy &lt;&lt; "\n Let's
count to three: \n" &lt;&lt; a &lt;&lt; b &lt;&lt; c; <i>/ Print some text using console
out in c++.  return 0; /</i> We end our program.  } #+END<sub>SRC</sub>
</p>

<p>
To save our work, we type c-x c-s.  Now, explore the file using c-p
and c-n and then go by words with m-f and m-b.  Some new keys that are
specific to this mode are m-p and m-n which move you to the previous
and next statement respectively.  Make some changes to the comments.
Use c-d for character deletion, m-d for word deletion and c-k for
deleting a whole line.  c-y "yanks" the line back from being killed.
It's Emacs talk for paste.
</p>

<p>
Have a look at the c-mode menus that are added to the menu bar by
hitting f10 or alt + grave.  When you do the next exercise, notice how
they are different in the mode for your own language.  The cc-mode has
a lot of other functionality but it is something best explored on your
own since it is only of interest to you if you code in c++ and
explanations of how that is done are way beyond the scope of this
tutorial.  Another thing to look at is the list of hotkeys specific to
it by typing c-h m and then moving to the help buffer with c-x o.
Incidentally, c-h b will give you a more compact list of hotkeys.
</p>
</div>


<div id="outline-container-orgceb5401" class="outline-4">
<h4 id="orgceb5401"><span class="section-number-4">4.3.1.</span> Exercise:</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
From a command prompt, launch emacspeak with a new program in a
language you are familiar with like Python.  Explore how Emacspeak
will talk in certain situations and with certain elements of code.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org987bf3e" class="outline-2">
<h2 id="org987bf3e"><span class="section-number-2">5.</span> Onto the wide wide world:</h2>
<div class="outline-text-2" id="text-5">
<p>
Emacspeak lets you have access to all elements of the internet.
Whether it's e-mail, the web, chatting with Irc, social networking
with Facebook and Twitter or reading your favorite newsgroups, it can
all be done from within Emacs and Emacspeak has been written with
support for this functionality.  We will explore some of this in the
next few sections.
</p>
</div>


<div id="outline-container-org6fc259e" class="outline-3">
<h3 id="org6fc259e"><span class="section-number-3">5.1.</span> How about a chat?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Chatting with Emacspeak is truly a breeze.  You won't believe how easy
it is.  The best way to illustrate that is to show you how you would
chat on the Vinux irc channel.  Here's what you do:
</p>

<ol class="org-ol">
<li>Launch Emacspeak from the command prompt with speakup toggled off by pressing insert + numpad enter.</li>
<li>Once it's up, press m-x and then type erc and press enter.  Note the spelling, please, it's not a typo.</li>
<li>Answer the prompts such as the irc server, the port (best left as default) and then the nickname you want to log in complete with any applicable password.  Press enter after each entry.  This will get you onto the irc server from which you can then join a channel of your choosing.</li>
</ol>
<p>
Example:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Irc Server</td>
<td class="org-left">irc.blufudge.net</td>
</tr>

<tr>
<td class="org-left">port</td>
<td class="org-left">6667</td>
</tr>

<tr>
<td class="org-left">Username</td>
<td class="org-left">AlexM</td>
</tr>

<tr>
<td class="org-left">Password</td>
<td class="org-left">Gobbldy-gook</td>
</tr>
</tbody>
</table>

<p>
Give it a few moments and it should tell you that you are on the
server you chose.  At this point, things get pretty straightforward
because now, you can use the menu bar which can be reached with f10 or
alt grave accent and arrow to the erc-mode menu and press enter.
Choose an option such as joining a channel and then type in the
channel you want to join.  Another way to do this is to just type
/join #channelName as you would in any other irc client.  All the
usual irc commands work here.  the menu bar contains a few helpful
shortcuts for when you don't know them but you can get away without
ever visiting it.
</p>
</div>

<div id="outline-container-org64f930a" class="outline-4">
<h4 id="org64f930a"><span class="section-number-4">5.1.1.</span> Actual chatting tips</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Once you have joined a channel, you will want to monitor it so you
know what people are saying.  To do this, type c-c c-m.  This will
monitor your current channel.  If you have auditory icons turned on,
you will get a little sound preceding every message someone types.
To talk to someone, just type what you want to say and press enter.
You'll hear a little ding if you have auditory icons but not the text
you typed.  To get past this, I usually turn on line echo locally with
c-e d l.
</p>

<p>
You can have multiple channels at a time which you are monitoring.
Personally, I have no idea why someone would want to do this but, I'm
sure there are reasons out there for wanting to do this.  If you have
such a reason, each channel is in its own buffer.  All you have to do
to switch back and forth between channels you are on is to go to the
buffer containing that channel and its conversations by hitting c-x
c-b for the buffer list, arrowing down to the buffer in question and
hitting enter on it.  Once you are done chatting, just use /leave to
leave the channel you are on or go to the menu bar and find the leave
command in the erc-mode menu.  Once you've done this, you can either
disconnect from the server or just kill the buffer you are on to stop
your erc session.  And that's all there is to it!
</p>
</div>
</div>
</div>
