info/tutorial.org
**  Let's browse the web. 
In the words of Emacspeak's author DR. T. V. Raman, "There are many
solutions for browsing the web in Emacspeak neither of them entirely
satisfactory."  For most simple html and css pages, you can definitely
have a very pleasing browsing experience with Emacs w3, the closest
thing Emacs has to a a native browser.  W3 doesn't have a Javascript
interpreter so, anything containing javascript will have to be
accessed through other solutions.  I will leave it up to you to
explore these as this is merely a tutorial for getting your feet wet.
W3 is a nice little browser which should fulfill a large percentage of
your browsing needs.  When it comes to more complex ones, however, you
will really want to use another tool like Firefox through Orca.  Since
Orca currently has some slowness issues with regard to browsing,
though it is good to know that, at least, for some of your browsing,
you can indeed turn to Emacspeak and quickly go through web content.
Here's how to get started doing this.  The plugin you will need is an
emacs-native browser called Emacs w3.  It's not shipped with Emacs and
its development has stagnated in recent years but it's still a nice
browser as long as you aren't trying to nview web pages with lots of
javascript.  It's even got support for aural css which is a rather
neat feature.  I'll et you Google what this is since discussions on it
can get lengthy.  Anyway, Emacs w3 can be put on through Elpa.  Refer
to the section in this tutorial that discusses how to set it up and
how to install packages using this tool.  For the rest of this
section, I'm going to assume that you followed these instructions and
have Emacs w3 installed.  Another thing you may wish to consider is
making it so that all html documents which are rendered and pulled up
as webpages instead of source code get pulled up in w3 and not
something else like Firefox.  This can be done in the customizations
area.  Type c-h cap B then arrow up to the appropriate subsection and
navigate to where this can be done.  The setting you want to change is
labeled "browse url."

To bring it up, simply press m-x and then type w3.  It should bring up
a homepage for itself on the gnu.org site.  To move around the web,
here are the basic commands.  Note the capitalization of these
commands:

+  Moving forward and backward through the available links on a page :: tab and alt tab respectively
+  Selecting a link ::  Enter or return as it's called hereabouts
+  Open a url ::  c-o  (this one should be no sweat)
+  top and bottom of document :: < and > respectively 
+  Scroll down a page :: space bar
+  Scroll up a page :: del key
+  Reload page :: r
+  Back to your previous page :: cap B 
+  Forward to the next page :: cap F.
+  View html source of the page you are on :: s
+  quit :: q

These commands should get you started.  If you want more, remember,
you always have c-h m to consult.  It will bring up a list of all the
hotkeys for you.  There are many many more than the ones I mentioned.
Also, please note that w3 has it's own menu bar.  You should find it
pretty easy to follow since it's very similar to other browsers' menu
bars.

While you browse, Emacspeak will announce links in a lower pitch voice
and will also modulate its voice depending on headings, quotes and
other attributes of the document you are browsing.  But, you may ask,
are there no specific Emacspeak commands?  There are many and I will
let you explore them as you get used to Emacs itself.  But, there is
one priceless gem you will find quite useful which I will discuss in
the next subsection.

***  Url Templates

One of Emacspeak's greatest strengths is how it presents you with
information and how it allows you to interact with Emacs.  It's not a
screen reader in the strictest sense of the word because, it doesn't
tell you what's on the screen but, rather, what you need to know to
get the job done.  All you have to do to prove this point is navigate
with your numberpad if you have speakup set to off with numpad Enter.
You will actually hear the physical layout of the screen whereas
Emacspeak lets you have what you need when you need it.  An
outstanding example of this is the nice variety of Url Templates
available.  These are nice shortcuts to parts of long web pages that
let you just get right down to business and not have to explore a page
for a long time before arriving at where you want to go.  Let's
explore a couple of these.

Weather forecast
1.  From anywhere within Emacspeak, press c-e u.  This puts you at the top of a long list of templates.  
2.  Arrow down till you hear "Weather Underground."  Press enter.  
3.  You are right at the edit field where you type in your city and state or country of residence to get a weather report.  Go ahead and type it in and press enter.  If you are in the U.S. you can also just type in your zip code.
4.  Explore your weather forecast with the commands shown above.

Bookshare search:

1.  Again, we type c-e u to bring up our url template list.
2.  Arrow down to the bookshare search entry and press enter.
3.  At the prompt, type in your search query and press enter.  
4.  Use the w3 commands to navigate the resulting page.  When you are finished, press q to quit and you will be back where you left off before your browsing began.
***  Exercise.
1.  There is a lot more to w3 and Emacspeak than what I covered here.  Take a few moments and explore it thoroughly using the info pages, and by googling for more information online.  Conveniently, there's a google search URL.  Try putting it to use in this way and use your newfound knowledge to browse the resultant page.
2.  Checking your gmail account.  Use the url template for gmail which has been provided to check your e-mail in gmail through a browser session.  Write a few e-mails yourself.  This will teach you some new commands and show you how to interact with forms.  If you get stuck, remember c-h b and c-h cap m contain key bindings which might get you out of a pinch.

