info/tutorial.org
** Sending e-mail

If you have a setup on your linux box that enables you to send and
receive mail system wide, Emacs can also be used as a mail client.  If
you don't have this set up yet, I will warn you that it is a pretty
technical and advanced thing to do and will consume some time if you
have never done it before.  You will need to acquire and configure
Fetchmail, Procmail and either Postfix or Sendmail.  These are
programs that handle different aspects of sending and receiving e-mail
at a system level.  Emacs then pulls the incoming messages from your
system mail box usually located in /var/mail/username whereX user name
is your login name on your machine.  Outgoing mail gets sent out
through whatever you are using as an outgoing mail handling program
such as Sendmail or Postfix.  There is a lot of information out there
on the net on how to set this stuff up on your machine.  I suggest you
have a good look at it before attempting this.

Assuming you got it set up, here's how you send and receive e-mail
with Emacs.  We will use the basic mail-mode.  There are two other
more complex ones that ship with Emacs called Gnus and mh-e which can
be used for this purpose which you are encouraged to investigate.
There are others which can be gotten through synaptic or by visiting
webpages containing them on the net and installing them directly by
hand.  Dr. Raman states in the user manual for Emacspeak that he is
partial to VM.

First, reading your e-mail is as easy as typing m-x rmail.  The
interface is a bit old fashioned so you will get a ton of header file
information that most other clients just hide from you.  Use c-n to
get past all of that stuff and you will get to the body of your
message.  You can use either c-e B (note the capital b), to tell
Emacspeak to read the whole buffer from point to you or you can read
the message by screenful with c-v.  m-n will take you to the next
message once you are done reading it.  As usual, there's also a menu
bar that contains many more features and c-h b or c-h m will give you
more hotkeys if you don't want to fool with the menu bar.  To exit the
mail mode, hit q for quit.

Sending e-mail is done by typing c-x m.  You are at a" to:" prompt.
Just type the e-mail address of your recipieent and hit down arrow to
get to subject.  Type in the subject and arrow down twice because
there's a line of dashes you have to get past.  Type your message and
then c-c c-c to send it out and exit mail.  Again, you are encouraged
to explore the other features by using the menu bar and the hotkey
lists.

*  Retreat into your shell, why don't you? 
Emacspeak grants you access to a shell from within Emacs by making it
fully speech enabled.  All you do is type m-x and then, at the prompt,
you type the word shell and press enter.  You will then hear a command
line prompt which you can treat like you would any other.  All of the
cursor movement keys are operational.  Also, all of the emacspeak
reading commands are operational so you can interact with other parts
of the screen without moving your cursor.  This means, that you can
usually scroll up quite a few lines to read output.  This shell is
extremely handy when performing system administration if something you
did caused you to lose speech in Speakup or Orca or Yasr.  Emacspeak
then becomes a very nice safety net.  Who knows?  YOu may even find
that you prefer accessing your shell from Emacspeak as opposed to
speakup or from a terminal within Gnome.  It is definitely convenient.

The shell also lets you launch programs like Alpine, Abook and Lynx
just as you would in a console session.  Emacspeak then acts like a
regular screen reader with these solutions.

An immediate use to which you can put the shell in the context of this
tutorial is by compiling the code we wrote earlier in the "Let's write
some code" section.  Here's what you do:

1.  From anywhere in emacs, type m-x.
2.  At the prompt, type shell and press enter.
3.  Now, we type g++ program1.cpp -o program1 and press enter.
4.  All the compiler messages you may be used to seeing will come
    right up for you .  Or, if all is well, it compiles without a
   hitch.  It shouldcompile but, if it doesn't for some reason, you
   will have to go in and fix the code.  I'm assuming you know some
   c++ so you can do that.  There are tons of people way more
   qualified than me to teach you c++.


The whole thing can be done right from inside Emacspeak.  Pretty
convenient, right?

* File Management

Emacs has a very nice file management mode called dired Mode.  It's
very powerful and fully enabled with all the Emacspeak functionality.
To access it, type either c-x d or m-x dired.  You will be placed in a
buffer which contains a list of the files in your current directory.
From here, you can delete, rename, change ownership, and much much
more.  It's a bonified file management system which rivals all the
others you have probably used.  Also, it keeps its interface whether
you are working on your own machine's files or even an ftp directory.

to navigate in this area, use your arrow keys to go up and down and
listen to the file names in the directory you are in.  To go to
another directory, go to the top of the buffer and arrow down a few
lines until you get to the line containing your current directory
location.  Hit c-e twice to get you to the end of the line and either
append the subdirectory you want to go to or backspace until you have
a blank line in which to type the name of the directory you want to go
to.  If you don't remember the full name, don't worry.  Emacs has
awesome completion features.  Just hit page up and you will be taken
to completions buffer where you can arrow to and press enter on the
item you want.  Aside from the global hotkeys discussed in the
introductory material, there are many more unique to this mode which
you can find by typing c-h b.  Then, c-x o to get to the other window
and read the help file listing them all.  If you don't feel up to
hotkeys, there is, of course, a nice set of menus from which you can
choose by hitting alt grave.

