info/tutorial.org
*  Playing media files in Emacspeak

Note: This section was written by Dave Hunt.  Some very minor
modifications to sentence structure were made to fit into this
tutorial as a whole but, I've changed as little as I could of his
original content.  Thanks, Dave!---Alex Midence

First things first, using dired mode to browse and listen to music
files will not work. In its default setup, dired mode will not open
external apps, such as mplayer. Rather, it will visit the file at '.'
in a new buffer, applying appropriate editing/display 'modes' to this
buffer. In the case of an 'mp3' file, it likely opens in 'fundamental
mode'. This is a text editing mode, used in the absence of other
modes.  If you do not have Mplayer installed on your machine already,
go ahead and install it before you set Emacs up to play your media
files.  Now that mplayer is installed, get the emms (Emacs Multimedia
System) package. You can use elpa for this. Next, put some setup code
into '~/.emacs', here it is:

#+BEGIN_SRC emacs-lisp 
;;; mark here...  Fore emms.  (require 'emms-setup) (emms-all)
;;; (emms-default-players) (setq emms-source-file-default-directory
;;; "~/Music/") end lisp code #+END_SRC

I cobbled the above together from my reading of the '.info' doc for
emms, and some use of the 'describe-mode', 'describe-variable', and
'describe-function' operations. Being fueled with a super-duper latte
helped, too. While writing this, I started emms-browse-by-artist, one
of the available functions. If your files are tagged, you'll be able
to browse by artist, album, genre, and year. Maybe there are more?
Anyway, you'll get a kind of 'tree view', in which hitting 'spacebar'
expands and collapses branches. 'shift+return' adds selected track to
playlist; 'c-j' plays. You can shuffle, sort, edit your playlist.

Another music option is emacs-m-player, a front-end that controls your
installed mplayer app. One way to start it is to type 'm-x
emacspeak-m-player' and hit 'enter'. You'll be asked for a resource to
play. This should be a playlist, in the form of '.m3u' or '.pls'. The
default is to play tracks, in order. If you want to play a stream, you
can either save its playlist to a local directory, and use
emacspeak-m-player, or, you can use one of the emacs web clients, and
an associated function for playing the url at '.'. Here's an example:
I like the station 'radioparadise.com'. If I use the w3m browser, I
can visit this main page, go to the 'listen now' area, and select one
of the links. Typing 'l', when the link is under '.', automatically
launches emacspeak-m-player and gives it the stream's playlist. To do
this same thing in the w3 browser, I can put '.' on the desired link,
and type 'e e'. I'll be prompted for the name of the function to pass
the url to.  'emacspeak-m-player' should begin playing the stream. If
I now go back to the emacspeak-m-player buffer, I have a few
single-key commands, including '+' and '-' to raise and lower
volume. There are a bunch of commands for adjusting the balance and
eq, but I've not used them.  I find the playing of music within emacs
very cumbersome, and usually save my listening for when I'm in Gnome,
where I use rhythmbox.


*  Wrapping it up

When I set out to write this little tutorial, it was out of a desire
to help prospective new users of Emacspeak get a taste of its power
and potential for enhancing their productivity and do so painlessly
and as quickly as possible.  I wanted to do this in such a way that
said newcomers would actually be able to get a feel for this by
accomplishing something worthwhile within the first few minutes after
launching it.  I also wanted to do something about decreasing the
steep learning curve Emacs and, by extension Emacspeak has due to the
different interface and the higher expectation of tweaking from the
end user.  I hope I have succeeded.  I hope that you have decided to
learn more about Emacspeak and that you have been encouraged to
investigate all its possibilities.  It is rare that a blind person
finds a truly accessible, low cost, and reliable piece of software
that puts one on an equal footting with sighted counterparts in the
manner Emacspeak does.  We can all be grateful that Dr. T. V. Raman
was generous enough to share his software with all of us the way that
he did and that he chose to do so free of cost at a time when
assistive technology seems enamoured with the $1000 figure.  The man
can not be commended enough, in my humble opinion.  It's no accident
that Emacspeak has gotten the accolades it has and enjoys the fierce
devotion of its userbase the way that it does.  I'm sure you will
agree by now that it is an awesome bit of software and a must-have in
your accessibility toolkit.

Hopefully, what you did is pick one of the tasks introduced above,
tried it out and then promptly turned around and tried them all out
possibly in order but maybe not.  If you didn't do this, I want you to
go back and do so.  Once you have done this, I want you to do some
homework.  Yes, I'm a teacher by profession , as it turns out and
giving homework comes as naturally to me as breathing.  I want you to
investigate social networking with Emacspeak.  I also want you to
check out the games which Dr. Raman has enabled on here.  Tetris, for
one, is quite interesting as is chess and all the rest.  As for the
social networking stuff, here's a tip, Facebook and Twitter have their
own modes in Emacs whose individual manuals are just a google search
away.  E-mail has many modes also, some of them much more advanced
than the one we explored together.  A few of these are built into
Emacs itself and still others can be gotten through Synaptic package
manager.  This, too, is just a google search away.  I also want you to
look into other authoring modes like Muse Mode and even Auctext.  The
latter is pretty advanced but, extremely handy to know since it lets
you create a document and set the type-facing on it so that it comes
out looking great and you can do this without vision just by using
markup in the LateX language.  For those of you with a bent towards
coding, give Emacs Lisp a shot.  There's an info manual right inside
of Emacs that you can use to help you get started right away.  Make
some code contributions for us all to benefit from.  We can not expect
Dr. Raman to do it all, you know.  We must all give something back.
Lastly, I want you to always be willling to help other newcomers to
Emacspeak out by aiding them in learning this piece of software
quickly and become productive in it very quickly.  In fact, share your
new discoveries with other users of all levels in places like the
Emacspeak list and the Vinux Forum.  I look forward to learning from
such postings.


