info/tutorial.org
*  Acknowledgements

I'd like to thank some people specifically for their help in filling
in gaps and correcting errors as well as those who provided source
materials from which to draw:

+  Richard M. Stallman and T. V. Raman  ::  Let's give credit where it
     is so truly due, shall we?  These two have my sincere grattitude
  for creating such an amazing application and interface respectively.
+  Tim Cross from the Emacspeak list :: Thank you for helping out
     with some of the elisp code questions I had.
+  David Ring of  the vinux lists  :: Your many postings, howto contributions and responses
     to inquiries were of immense help as I learned Emacspeak and then
  decided to write this document.
+  Robert Crawford from the Emacspeak list ::  Your corrections were
     invaluable.  Thank you very much indeed!
+  Dave Hunt from the Vinux Support Forum ::  Thank you for
     contributing the section on playing music with Emacspeak.
+ Anthony  Sales  ::  A very very special thank you goes to you
     for creating and implementing Vinux.  It is a truly wonderful
  Linux, absolutely perfect for visually impaired users of all
  technical levels.


*  Appendices
**  Installing Emacspeak 
This tutorial was written for users of the Vinux distribution of Linux
which, as of version 3.01, comes with Emacspeak pre-installed for you.
However, if you are using another distribution or, you just want to
build it up yourself, the following supplemental sections will walk
you through doing just that.
***    Using Synaptic 
This section assumes prior experience using the Synaptic package
manager system found in Debian-based Linux distributions:

1.  From within synaptic, type control f for search and type Emacs and
    press enter.
2.  Tab a few times till you get to the package column and arrow down
    through the choices until you get to either emacs 23 or emacs gtk.
3.  Press control i to mark for installation.
4.  Press control p to apply changes and build Emacs before installing
    emacspeak.
5.  Once Emacs is done installing, type control f for find again and
    type in emacspeak.  6 as before and arrow through the choices you
    are provided.  Emacspeak 32 is the one you want.
7.  Mark and apply changes as instructed above with control i and
    control p.
8.  Inform Emacspeak at the prompt that you are using espeak as a
    speech synthesizer and none as the port and select forward.
9.  You will need to repeat the port number towards the end of
    installation too.
10.   Once Emacspeak is done building, just run it from the command
     line using emacspeak.
***  Using the command line 
In Vinux, installing Emacspeak is as easy as:
#+BEGIN_EXAMPLE
    sudo apt-get install emacspeak #+END_EXAMPLE

All the dependencies will be built for you.  The only danger is that
it will build with the emacs 23 Metapackage of Ubuntu and it includes
some stuff whose behavior I am not sure of and which has produced odd
effects for me in the past.  You may not have these problems, however.

If your distribution is other than Vinux, the recommendation is as
follows:

1.  Install Emacs on your machine first.  This is done by either apt-get or through another one of your favorite package management solutions in Linux.
2.  Once Emacs is built, then, use that same package manager to build emacspeak on it.  

example:
#+BEGIN_EXAMPLE
    apt-get install emacs apt-get install emacspeak #+END_EXAMPLE

Either way, you will get a menu prompting you to choose which speech
synthesizer to use.  E-speak is my recommendation since it is free and
reliable and can be sped up quite a bit.  You will be asked for a
server port.  Answer none to this question and tab to the forward
button and press enter.  YOu may be asked this question again.  Answer
none each time.  Eventually, everything will build and you will be
able to launch Emacspeak from the console command prompt.

**  Emacs and Emacspeak links:  For when you want to go fishing


"Give someone a fish, and you have fed them for a meal.  Teach them to
fish and you have fed them for life."--Somebody very smart.

Now that you have gotten your feet wet with Emacspeak, it's time for
you to expand your knowledge.  Here are some links you can visit that
should help you with that.


+  [[http://emacspeak-guide.sourceforge.net/tutorial.html/][A Gentle Introduction to Emacspeak]] ::  This is an old tutorial which still holds valuable information.  Just watch out for outdated links in it.  It was written way back in good old y2k.
+  [[http://jeremy.zawodny.com/emacs/emacs.html][The Emacs Beginners Howto]]  ::  An Excellent document written to introduce people to Emacs.
+  [[http://emacspeak.sourceforge.net/info/index.html#Top][Emacspeak User's Manual Second Edition]]  ::  There are two Emacspeak Users Guides that can be found online, this is the link to the most recent.
+  [[http://emacspeak.sourceforge.net/user-guide/][Emacspeak Users Guide]]  ::  This is the older document mentioned previously.  There are still many valuable pieces of information in there so, I still think it is worth posting here.
+  [[http://www.gnu.org/software/emacs/manual/html_node/emacs/index.html][The Emacs Manual]]  ::  Not to be confused with the Emacspeak manual, this link takes you to the user's manual for Emacs itself.  It is big, exhaustive, and very well-written.  It covers just about anything you'd ever want to know about Emacs.
+  [[http://www.emacswiki.org/][The Emacs Wiki]]  ::  Extremely valuable resource!  There is a ton of information to be found here on just about everything.
+  [[http://www.gnu.org/software/emacs/manual/][Online Gnu Emacs Manuals]]  ::  This page contains links to manuals for many of the modes and extensions discussed in this tutorial and then some.
+  [[http://www.gnu.org/software/emacs/emacs-lisp-intro/html_node/index.html][An Introduction to Emacs Lisp]]  ::  Eventually, if you use it enough, you'll want to learn how to really tweak Emacs to your specifications.  You might even write an extension yourself.  This link takes you to a resource for learning how to do just that.  At that point, you are officially an Emacs guru.


Finally, Emacspeak has a mailing list to whichyou can subscribe.  The
subscription address is
[[mailto:emacspeak-request@cs.vassar.edu][emacspeak-request@cs.vassar.edu]]
and the address to post messages is
[[mailto:emacspeak@cs.vassar.edu][emacspeak@cs.vassar.edu]].  To
browse the list archives, the url is
[[http://www.cs.vassar.edu/~priestdo/emacspeak/][http://www.cs.vassar.edu/~priestdo/emacspeak/]].

Now, go fish!


