info/tutorial.html


<div id="outline-container-org1cd7808" class="outline-2">
<h2 id="org1cd7808"><span class="section-number-2">10.</span> Acknowledgements</h2>
<div class="outline-text-2" id="text-10">
<p>
I'd like to thank some people specifically for their help in filling
in gaps and correcting errors as well as those who provided source
materials from which to draw:
</p>

<dl class="org-dl">
<dt>Richard M. Stallman and T. V. Raman </dt><dd>Let's give credit where it
   is so truly due, shall we?  These two have my sincere grattitude
for creating such an amazing application and interface respectively.</dd>
<dt>Tim Cross from the Emacspeak list</dt><dd>Thank you for helping out
with some of the elisp code questions I had.</dd>
<dt>David Ring of  the vinux lists </dt><dd>Your many postings, howto contributions and responses
   to inquiries were of immense help as I learned Emacspeak and then
decided to write this document.</dd>
<dt>Robert Crawford from the Emacspeak list</dt><dd>Your corrections were
invaluable.  Thank you very much indeed!</dd>
<dt>Dave Hunt from the Vinux Support Forum</dt><dd>Thank you for
contributing the section on playing music with Emacspeak.</dd>
<dt>Anthony  Sales </dt><dd>A very very special thank you goes to you
   for creating and implementing Vinux.  It is a truly wonderful
Linux, absolutely perfect for visually impaired users of all
technical levels.</dd>
</dl>
</div>
</div>


<div id="outline-container-org1633df5" class="outline-2">
<h2 id="org1633df5"><span class="section-number-2">11.</span> Appendices</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org0c0784f" class="outline-3">
<h3 id="org0c0784f"><span class="section-number-3">11.1.</span> Installing Emacspeak</h3>
<div class="outline-text-3" id="text-11-1">
<p>
This tutorial was written for users of the Vinux distribution of Linux
which, as of version 3.01, comes with Emacspeak pre-installed for you.
However, if you are using another distribution or, you just want to
build it up yourself, the following supplemental sections will walk
you through doing just that.
</p>
</div>
<div id="outline-container-org0710214" class="outline-4">
<h4 id="org0710214"><span class="section-number-4">11.1.1.</span> Using Synaptic</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
This section assumes prior experience using the Synaptic package
manager system found in Debian-based Linux distributions:
</p>

<ol class="org-ol">
<li>From within synaptic, type control f for search and type Emacs and
press enter.</li>
<li>Tab a few times till you get to the package column and arrow down
through the choices until you get to either emacs 23 or emacs gtk.</li>
<li>Press control i to mark for installation.</li>
<li>Press control p to apply changes and build Emacs before installing
emacspeak.</li>
<li>Once Emacs is done installing, type control f for find again and
type in emacspeak.  6 as before and arrow through the choices you
are provided.  Emacspeak 32 is the one you want.</li>
<li>Mark and apply changes as instructed above with control i and
control p.</li>
<li>Inform Emacspeak at the prompt that you are using espeak as a
speech synthesizer and none as the port and select forward.</li>
<li>You will need to repeat the port number towards the end of
installation too.</li>
<li>Once Emacspeak is done building, just run it from the command
line using emacspeak.</li>
</ol>
</div>
</div>
<div id="outline-container-orge13a8b7" class="outline-4">
<h4 id="orge13a8b7"><span class="section-number-4">11.1.2.</span> Using the command line</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
In Vinux, installing Emacspeak is as easy as:
#+BEGIN<sub>EXAMPLE</sub>
</p>
<p>
sudo apt-get install emacspeak #+END<sub>EXAMPLE</sub>
</p>

<p>
All the dependencies will be built for you.  The only danger is that
it will build with the emacs 23 Metapackage of Ubuntu and it includes
some stuff whose behavior I am not sure of and which has produced odd
effects for me in the past.  You may not have these problems, however.
</p>

<p>
If your distribution is other than Vinux, the recommendation is as
follows:
</p>

<ol class="org-ol">
<li>Install Emacs on your machine first.  This is done by either apt-get or through another one of your favorite package management solutions in Linux.</li>
<li>Once Emacs is built, then, use that same package manager to build emacspeak on it.</li>
</ol>

<p>
example:
#+BEGIN<sub>EXAMPLE</sub>
</p>
<p>
apt-get install emacs apt-get install emacspeak #+END<sub>EXAMPLE</sub>
</p>

<p>
Either way, you will get a menu prompting you to choose which speech
synthesizer to use.  E-speak is my recommendation since it is free and
reliable and can be sped up quite a bit.  You will be asked for a
server port.  Answer none to this question and tab to the forward
button and press enter.  YOu may be asked this question again.  Answer
none each time.  Eventually, everything will build and you will be
able to launch Emacspeak from the console command prompt.
</p>
</div>
</div>
</div>

<div id="outline-container-org9c7dd64" class="outline-3">
<h3 id="org9c7dd64"><span class="section-number-3">11.2.</span> Emacs and Emacspeak links:  For when you want to go fishing</h3>
<div class="outline-text-3" id="text-11-2">
<p>
"Give someone a fish, and you have fed them for a meal.  Teach them to
fish and you have fed them for life."&#x2013;Somebody very smart.
</p>

<p>
Now that you have gotten your feet wet with Emacspeak, it's time for
you to expand your knowledge.  Here are some links you can visit that
should help you with that.
</p>


<dl class="org-dl">
<dt><a href="http://emacspeak-guide.sourceforge.net/tutorial.html/">A Gentle Introduction to Emacspeak</a></dt><dd>This is an old tutorial which still holds valuable information.  Just watch out for outdated links in it.  It was written way back in good old y2k.</dd>
<dt><a href="http://jeremy.zawodny.com/emacs/emacs.html">The Emacs Beginners Howto</a> </dt><dd>An Excellent document written to introduce people to Emacs.</dd>
<dt><a href="http://emacspeak.sourceforge.net/info/index.html#Top">Emacspeak User's Manual Second Edition</a> </dt><dd>There are two Emacspeak Users Guides that can be found online, this is the link to the most recent.</dd>
<dt><a href="http://emacspeak.sourceforge.net/user-guide/">Emacspeak Users Guide</a> </dt><dd>This is the older document mentioned previously.  There are still many valuable pieces of information in there so, I still think it is worth posting here.</dd>
<dt><a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">The Emacs Manual</a> </dt><dd>Not to be confused with the Emacspeak manual, this link takes you to the user's manual for Emacs itself.  It is big, exhaustive, and very well-written.  It covers just about anything you'd ever want to know about Emacs.</dd>
<dt><a href="http://www.emacswiki.org/">The Emacs Wiki</a> </dt><dd>Extremely valuable resource!  There is a ton of information to be found here on just about everything.</dd>
<dt><a href="http://www.gnu.org/software/emacs/manual/">Online Gnu Emacs Manuals</a> </dt><dd>This page contains links to manuals for many of the modes and extensions discussed in this tutorial and then some.</dd>
<dt><a href="http://www.gnu.org/software/emacs/emacs-lisp-intro/html_node/index.html">An Introduction to Emacs Lisp</a> </dt><dd>Eventually, if you use it enough, you'll want to learn how to really tweak Emacs to your specifications.  You might even write an extension yourself.  This link takes you to a resource for learning how to do just that.  At that point, you are officially an Emacs guru.</dd>
</dl>


<p>
Finally, Emacspeak has a mailing list to whichyou can subscribe.  The
subscription address is
<a href="mailto:emacspeak-request@cs.vassar.edu">emacspeak-request@cs.vassar.edu</a>
and the address to post messages is
<a href="mailto:emacspeak@cs.vassar.edu">emacspeak@cs.vassar.edu</a>.  To
browse the list archives, the url is
<a href="http://www.cs.vassar.edu/~priestdo/emacspeak/">http://www.cs.vassar.edu/~priestdo/emacspeak/</a>.
</p>

<p>
Now, go fish!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Midence</p>
<p class="date">Created: 2021-11-28 Sun 07:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
